Repository: HSSamuel/MEDGuard
Catalog: frontend/translations/ig/LC_MESSAGES/messages.po
Languages: ig

source: About MedGuard
ig: Gbasara MedGuard

source: Your Partner in Pharmaceutical Safety
ig: Onye Mmekọ Gị na Nchekwa Ọgwụ

source: is a comprehensive, multi-faceted public health platform designed with a singular, critical mission: to build a resilient and transparent pharmaceutical supply chain in Nigeria. We aim to safeguard public health by detecting, reporting, and managing counterfeit drugs while also monitoring the safety of legitimate medications through adverse reaction reporting.
ig: bụ usoro ahụike ọha na eze zuru oke, nke nwere ọtụtụ akụkụ nke e mere maka otu ebumnuche dị oke mkpa: iwu usoro nnyefe ọgwụ na-agbanwe agbanwe na nke doro anya na Naịjirịa. Ebumnuche anyị bụ ichebe ahụike ọha na eze site n'ịchọpụta, ịkọ akụkọ, na ijikwa ọgwụ adịgboroja ma na-enyochakwa nchekwa nke ezigbo ọgwụ site na mkpesa mmeghachi omume ọjọọ.

source: The Silent Epidemic
ig: Ọrịa na-efe efe nke dị jụụ

source: The circulation of counterfeit and substandard drugs is a silent epidemic with devastating consequences. These fake medications can contain incorrect ingredients, the wrong dosage, or even toxic substances, leading to treatment failure, severe health complications, and death. This threat erodes public trust in our healthcare system, putting every citizen at risk.
ig: Mgbasa nke ọgwụ adịgboroja na nke na-erughị eru bụ ọrịa na-efe efe nke dị jụụ nke nwere nsonaazụ na-ebibi ihe. Ọgwụ adịgboroja ndị a nwere ike ịnwe ihe ndị na-ezighi ezi, usoro onunu ogwu na-ezighi ezi, ma ọ bụ ọbụna ihe ndị na-egbu egbu, na-eduga n'ọgwụgwọ ọdịda, nsogbu ahụike siri ike, na ọnwụ. Ihe iyi egwu a na-emebi ntụkwasị obi ọha na eze na usoro nlekọta ahụike anyị, na-etinye nwa amaala ọ bụla n'ihe ize ndụ.

source: A Two-Pronged Defense
ig: Nchedo Abụọ

source: MedGuard tackles this challenge with a dual-layered approach, empowering both the public and regulatory bodies like NAFDAC to become active guardians of our nation's medicine supply.
ig: MedGuard na-eji usoro nwere okpukpu abụọ agafe nsogbu a, na-enye ma ọha na eze na ndị na-ahụ maka nhazi dịka NAFDAC ike ịghọ ndị nche na-arụsi ọrụ ike nke nnyefe ọgwụ nke mba anyị.

source: Counterfeit Drug Verification:
ig: Nkwenye Ọgwụ Adịgboroja:

source: We provide every Nigerian with simple, powerful tools to instantly verify the authenticity of their medication. Through QR code scanning and batch number verification, our platform serves as a frontline defense against dangerous fakes.
ig: Anyị na-enye onye Naijiria ọ bụla ngwaọrụ dị mfe ma dị ike iji chọpụta izi ezi nke ọgwụ ha ozugbo. Site na nyocha koodu QR na nkwenye nọmba ụyọkọ, ikpo okwu anyị na-eje ozi dị ka nchedo ihu megide adịgboroja dị ize ndụ.

source: Pharmacovigilance & Safety Monitoring:
ig: Nleba anya n'ọgwụ & Nleba anya Nchekwa:

source: Our mission extends beyond counterfeits. MedGuard provides a direct channel for the public to report adverse drug reactions (ADRs) to legitimate medications. This crowdsourced data is critical for post-market surveillance and ensures that even approved drugs are continuously monitored for safety.
ig: Ebumnuche anyị karịrị adịgboroja. MedGuard na-enye ọwa kpọmkwem maka ọha na eze ịkọ akụkọ mmeghachi omume ọgwụ ọjọọ (ADRs) na ọgwụ ziri ezi. Nchịkọta data a dị oke mkpa maka nleba anya mgbe ahịa gachara ma na-ahụ na a na-enyocha ọbụna ọgwụ akwadoro maka nchekwa mgbe niile.

source: Our Core Features
ig: Atụmatụ Anyị bụ Isi

source: Instant QR & Batch Verification:
ig: Nkwenye QR & Nọmba ozugbo:

source: Instantly validate a drug's authenticity against a secure, regulator-managed database using your smartphone camera or by entering a batch number.
ig: Nyochaa izi ezi nke ọgwụ ozugbo megide nchekwa data echekwara, nke onye na-ahụ maka nhazi na-ejikwa site na iji igwefoto ama gị ma ọ bụ tinye nọmbaụyọkọ.

source: Anonymous Counterfeit Reporting:
ig: Mkpesa Adịgboroja na-amaghị aha:

source: Easily submit reports of suspicious medications, complete with photographic evidence and location data, to alert authorities in real-time.
ig: Nyefee akụkọ gbasara ọgwụ ndị a na-enyo enyo n'ụzọ dị mfe, tinyere ihe akaebe foto na data ebe, iji mee ka ndị ọchịchị mara ozugbo.

source: Adverse Drug Reaction (ADR) Reporting:
ig: Mkpesa Mmeghachi omume Ọgwụ Ọjọọ (ADR):

source: After verifying a legitimate drug, users can report any unexpected side effects, contributing vital data to national pharmacovigilance efforts.
ig: Mgbe ha kwenyesiri ike na ọgwụ ziri ezi, ndị ọrụ nwere ike ịkọ akụkọ mmetụta ọ bụla a na-atụghị anya ya, na-enye data dị mkpa maka mbọ nleba anya ọgwụ mba.

source: Offline SMS Functionality:
ig: Ọrụ SMS na-anọghị n'ịntanetị:

source: For citizens without consistent internet access, our system works via SMS, ensuring that everyone can verify their medication, anytime, anywhere.
ig: Maka ụmụ amaala na-enweghị ohere ịntanetị na-agbanwe agbanwe, usoro anyị na-arụ ọrụ site na SMS, na-ahụ na onye ọ bụla nwere ike nyochaa ọgwụ ha, n'oge ọ bụla, ebe ọ bụla.

source: Admin Dashboard for Regulators:
ig: Dashboard nchịkwa maka ndị na-ahụ maka nhazi:

source: A powerful, secure dashboard for authorities to view, filter, and manage all submitted counterfeit and ADR reports, complete with data visualizations and a live hotspot map.
ig: Dashboard siri ike, echekwara maka ndị ọchịchị iji lelee, nyochaa, na jikwaa akụkọ niile gbasara adịgboroja na ADR, tinyere ihe ngosi data na maapụ ebe nsogbu na-ekpo ọkụ.

source: Return to Home
ig: Laghachi n'ụlọ

source: 🛠 Admin — Register New Drug Batch
ig: 🛠 Nchịkwa — Debanye aha ọgwụ ọhụrụ

source: Loading time...
ig: Oge nbudata...

source: Session ends in:
ig: Oge ga-agwụ na:

source: Use this form to register a new drug batch and generate its QR code instantly.
ig: Jiri fọm a debanye aha ọgwụ ọhụrụ wee mepụta koodu QR ya ozugbo.

source: 💊 Registered Drugs
ig: 💊 Ọgwụ edebanyere aha

source: 📱 Simulate SMS
ig: 📱 Mee ka SMS

source: 📦 Batch Details
ig: 📦 Nkọwa nke Batch

source: Close Scanner
ig: Mechie Skena

source: Mfg Date
ig: Ụbọchị Mmepụta

source: Expiry Date
ig: Ụbọchị njedebe

source: Register &amp; Get QR
ig: Debanye aha & Nweta QR

source: 📷 Scan to Pre-fill
ig: 📷 Nyochaa iji mejupụta

source: 📄 Generated QR Code
ig: 📄 Koodu QR emepụtara

source: Right-click and save the image below to print or share.
ig: Pịa aka nri wee chekwaa onyonyo dị n'okpuru ka ibipụta ma ọ bụ kesaa.

source: 🚨 Counterfeit Reports
ig: 🚨 Akụkọ adịgboroja

source: Today’s Reports
ig: Akụkọ nke Taa

source: View All Reports
ig: Lelee Akụkọ niile

source: 🔍 Search reports...
ig: 🔍 Chọọ akụkọ...

source: From:
ig: Site na:

source: To:
ig: Ka:

source: Filter
ig: Nyochaa

source: Drug Name
ig: Aha ọgwụ

source: Location
ig: Ebe

source: Note
ig: Mara

source: Image
ig: Onyonyo

source: Analysis
ig: Nyocha

source: Date
ig: Ụbọchị

source: Reporter
ig: Onye nta akụkọ

source: Status
ig: Ọnọdụ

source: Actions
ig: Omume

source: No Image
ig: Enweghị onyonyo

source: Analyze
ig: Nyochaa

source: New
ig: Ọhụrụ

source: Checked
ig: Elele

source: Delete
ig: Hichapụ

source: No reports submitted yet.
ig: Enwebeghị akụkọ edobere.

source: 💊 Adverse Drug Reaction Reports
ig: 💊 Akụkọ mmeghachi omume ọgwụ ọjọọ

source: Search by drug, batch, or reaction...
ig: Chọọ site na ọgwụ, ogbe, ma ọ bụ mmeghachi omume...

source: Filter ADR
ig: Nyochaa ADR

source: Export Word
ig: Mbupụ Okwu

source: Export PDF
ig: Mbupụ PDF

source: Batch Number
ig: Nọmba Batch

source: Patient Info
ig: Ozi onye ọrịa

source: Reaction Description
ig: Nkọwa mmeghachi omume

source: Report Date
ig: Ụbọchị akụkọ

source: No Adverse Drug Reaction reports match the current filters.
ig: Enweghị akụkọ mmeghachi omume ọgwụ ọjọọ dabara na nzacha dị ugbu a.

source: Confirm Deletion
ig: Kwenye nhichapụ

source: Are you sure you want to delete ADR Report #
ig: Ị ji n'aka na ịchọrọ ihichapụ ADR Report #

source: ? This is permanent.
ig: ? Nke a bụ ihe na-adịgide adịgide.

source: Failed to delete report:
ig: Ihichapụ akụkọ daa:

source: Error checking for new reports:
ig: Njehie na-enyocha akụkọ ọhụrụ:

source: Please select both a start and end date.
ig: Biko họrọ ma ụbọchị mmalite na njedebe.

source: Search, filter, or export registered drug batches.
ig: Chọọ, nyochaa, ma ọ bụ bupu ọgwụ edebanyere aha.

source: Search by name or batch number
ig: Chọọ site na aha ma ọ bụ nọmba batch

source: -- All --
ig: -- Ha niile --

source: Valid
ig: Dị irè

source: Expired
ig: Kubiela

source: Expiring Soon
ig: Na-agwụ n'oge adịghị anya

source: 🔍 Search
ig: 🔍 Chọọ

source: 📅 Apply
ig: 📅 Tinye

source: Name
ig: Aha

source: Manufacturer
ig: Onye nrụpụta

source: Registered On
ig: Debanyere aha na

source: No drugs found.
ig: Enweghị ọgwụ achọtara.

source: ⬅ Prev
ig: ⬅ Gara aga

source: Page
ig: Ibe

source: of
ig: nke

source: Next ➡
ig: Osote ➡

source: ⬅ Back to Dashboard
ig: ⬅ Laghachi na Dashboard

source: Are you sure you want to delete this drug?
ig: Ị ji n'aka na ịchọrọ ihichapụ ọgwụ a?

source: Are you sure you want to delete the drug
ig: Ị ji n'aka na ịchọrọ ihichapụ ọgwụ ahụ

source: ? This action cannot be undone.
ig: ? Enweghị ike imegharị ihe a.

source: 🔐 Regulator Login
ig: 🔐 Nbanye onye nhazi

source: Official email
ig: Email gọọmentị

source: Show Password
ig: Gosi okwuntughe

source: 📍 Live Counterfeit Hotspot Map
ig: 📍 Map ebe a na-ere ahịa adịgboroja

source: This map displays the real-time locations of all submitted counterfeit drug reports. Use this intelligence to identify clusters and potential hotspots for targeted investigation.
ig: Maapụ a na-egosipụta ebe akụkọ niile gbasara ọgwụ adịgboroja ezigara ozugbo. Jiri ọgụgụ isi a chọpụta ụyọkọ na ebe ndị nwere ike ịbụ ebe a na-elekwasị anya maka nyocha ezubere iche.

source: Your session has expired. Please log in again to view the map.
ig: Oge gị agwụla. Biko banye ọzọ ka ịlele maapụ ahụ.

source: Public Drug Data Manager
ig: Njikwa data ọgwụ ọha

source: View, add, or edit entries in the public drug database. This information is shown to users when a scanned drug is not in the main MedGuard registry.
ig: Lelee, tinye, ma ọ bụ dezie ndenye na nchekwa data ọgwụ ọha. A na-egosi ndị ọrụ ozi a mgbe ọgwụ a nyochara anọghị na ndekọ MedGuard.

source: Current Public Drug List
ig: Ndepụta ọgwụ ọha dị ugbu a

source: ➕ Add New Drug
ig: ➕ Tinye ọgwụ ọhụrụ

source: Add New Drug Entry
ig: Tinye ndenye ọgwụ ọhụrụ

source: Batch Number (Unique Key):
ig: Nọmba Batch (Igodo pụrụ iche):

source: Drug Name:
ig: Aha ọgwụ:

source: Manufacturer:
ig: Onye nrụpụta:

source: NAFDAC Status:
ig: Ọnọdụ NAFDAC:

source: Expiry Date (YYYY-MM-DD):
ig: Ụbọchị njedebe (YYYY-MM-DD):

source: Save Entry
ig: Chekwa ndenye

source: Report an Adverse Reaction
ig: Kọọ mmeghachi omume ọjọọ

source: You are reporting a side effect for the following medication. Please provide as much detail as possible. Your report is anonymous and helps protect public health.
ig: Ị na-akọ mmetụta dị n'akụkụ maka ọgwụ na-esonụ. Biko nye nkọwa zuru ezu dị ka o kwere mee. Akụkọ gị amaghị aha ma na-enyere aka ichebe ahụike ọha.

source: Batch Number:
ig: Nọmba Batch:

source: Patient's Age Range
ig: Ogologo afọ onye ọrịa

source: Please select an age range...
ig: Biko họrọ oke afọ...

source: 0 - 17 years
ig: Afọ 0 - 17

source: 18 - 29 years
ig: Afọ 18 - 29

source: 30 - 49 years
ig: Afọ 30 - 49

source: 50 - 65 years
ig: Afọ 50 - 65

source: 66 years and over
ig: Afọ 66 gbagowe

source: Patient's Gender
ig: Okike onye ọrịa

source: Please select a gender...
ig: Biko họrọ okike...

source: Male
ig: Nwoke

source: Female
ig: Nwanyị

source: Prefer not to say
ig: Ọ ka mma ịghara ikwu

source: When did the reaction start?
ig: Kedu mgbe mmeghachi omume ahụ malitere?

source: Please describe the side effect(s)
ig: Biko kọwaa mmetụta dị n'akụkụ

source: Was the patient taking any other medications at the time?
ig: Onye ọrịa ahụ ọ na-aṅụ ọgwụ ọ bụla ọzọ n'oge ahụ?

source: List other drugs, vitamins, or supplements. If none, leave blank.
ig: Depụta ọgwụ, vitamin, ma ọ bụ mgbakwunye ndị ọzọ. Ọ bụrụ na ọ dịghị, hapụ oghere.

source: Submit Secure Report
ig: Nyefee akụkọ echekwara

source: Home
ig: Ụlọ

source: About
ig: Gbasara

source: My Reports
ig: Akụkọ m

source: Public DB Manager
ig: Njikwa DB ọha

source: Hotspot Map
ig: Map Hotspot

source: Language
ig: Asụsụ

source: Admin Logout
ig: Nbanye nchịkwa

source: Welcome,
ig: Nnọọ,

source: Logout
ig: Wepụ

source: User Login
ig: Nbanye onye ọrụ

source: Register
ig: Debanye aha

source: Confirm Action
ig: Kwenye Omume

source: Cancel
ig: Kagbuo

source: Confirm
ig: Kwenye

source: Session Timeout Warning
ig: Ịdọ aka ná ntị oge njedebe

source: Your session is about to expire due to inactivity. You will be logged out in
ig: Oge gị na-achọ ịgwụ n'ihi enweghị ọrụ. A ga-apụ gị apụ na

source: seconds.
ig: sekọnd.

source: Stay Logged In
ig: Nọrọ na Nbanye

source: Logout Now
ig: Wepụ Ugbu a

source: MedGuard — Fighting counterfeit medicine, one scan at a time.
ig: MedGuard - Na-alụso ọgwụ adịgboroja ọgụ, otu nyocha n'otu oge.

source: MedGuard Assistant
ig: Onye enyemaka MedGuard

source: Hello! How can I help you today? You can ask me how to verify a drug, how to report a counterfeit, or what to do if you find one.
ig: Ndewo! Kedu ka m ga-esi nyere gị aka taa? Ị nwere ike ịjụ m ka m ga-esi lelee ọgwụ, otu esi akọ akụkọ adịgboroja, ma ọ bụ ihe ị ga-eme ma ọ bụrụ na ị hụ otu.

source: Ask a question...
ig: Jụọ ajụjụ...

source: Send
ig: Zipu

source: I am sorry, I am having trouble connecting right now.
ig: Ndo, enwere m nsogbu ijikọ ugbu a.

source: Hello! I am the MedGuard Assistant. How can I help?
ig: Ndewo! Abụ m onye enyemaka MedGuard. Kedu ka m ga-esi nyere aka?

source: How to report a drug?
ig: Kedu otu esi akọ ọgwụ?

source: How to verify a drug?
ig: Kedu otu esi enyocha ọgwụ?

source: Check a batch status
ig: Lelee ọkwa batch

source: Page Not Found
ig: Ahụghị ibe

source: The page you are looking for does not exist.
ig: Ibe ị na-achọ adịghị.

source: Go to Homepage
ig: Gaa na ibe mbụ

source: Email Address
ig: Adreesị ozi ịntanetị

source: Password
ig: Okwuntughe

source: Sign in
ig: Banye

source: Don't have an account?
ig: Enweghị akaụntụ?

source: Register here
ig: Debanye aha ebe a

source: My Submitted Reports
ig: Akụkọ m edobere

source: Here is a history of the counterfeit drug reports you have submitted.
ig: Nke a bụ akụkọ ihe mere eme nke akụkọ ọgwụ adịgboroja ị nyefere.

source: Regulator Status
ig: Ọnọdụ onye nhazi

source: Pending Review
ig: Nlebanya na-echere

source: Reviewed
ig: Enyochala

source: You have not submitted any reports yet.
ig: I nyefebeghị akụkọ ọ bụla.

source: Delete Report
ig: Hichapụ akụkọ

source: Are you sure you want to delete this report? This action is permanent.
ig: Ị ji n'aka na ịchọrọ ihichapụ akụkọ a? Omume a bụ nke na-adịgide adịgide.

source: ➕ Create Your Account
ig: ➕ Mepụta Akaụntụ Gị

source: Full Name
ig: Aha zuru ezu

source: Create Account
ig: Mepụta Akaụntụ

source: Already have an account?
ig: Nwere akaụntụ ugbua?

source: Login here
ig: Banye ebe a

source: Offline / SMS Verification Simulation
ig: Nkwenye n'ịntanetị / SMS

source: This simulates sending an SMS with a batch number and receiving a text reply from the MedGuard system.
ig: Nke a na-eṅomi izipu SMS nwere nọmba ogbe wee nata nzaghachi ederede sitere na sistemu MedGuard.

source: Enter batch number
ig: Tinye nọmba batch

source: Simulate SMS
ig: Mee ka SMS

source: 📲 Simulated SMS Reply:
ig: 📲 Nzaghachi SMS emere eme:

source: Batch Verified by MedGuard
ig: Batch nke MedGuard kwadoro

source: This is an authentic drug registered in the MedGuard system.
ig: Nke a bụ ọgwụ izizi edebanyere aha na sistemu MedGuard.

source: Warning: Drug Expired
ig: Ịdọ aka ná ntị: Ọgwụ agwụla

source: This is a registered drug, but it has passed its expiry date. Do not use.
ig: Nke a bụ ọgwụ edebanyere aha, mana oge ya agwụla. Ejila ya.

source: Public Information Found
ig: Achọtara ozi ọha

source: Disclaimer: This information is from a public database and has <u>not</u> been independently verified by MedGuard.
ig: Nkwupụta: Ozi a sitere na nchekwa data ọha na MedGuard enyochabeghị ya n'onwe ya.

source: External Website Link
ig: Njikọ weebụsaịtị dị na mpụga

source: This
ig: Nke a

source: points to an external website. MedGuard cannot verify its authenticity. Proceed with caution.
ig: na-atụ aka na webụsaịtị dị na mpụga. MedGuard enweghị ike nyochaa izi ezi ya. Jiri nlezianya gawa.

source: Unregistered Product Code
ig: Koodu ngwaahịa edebanyeghị aha

source: This appears to be a standard product
ig: Nke a yiri ka ọ bụ ngwaahịa ọkọlọtọ

source: , not a MedGuard verification code. MedGuard cannot verify this item, but it has not been flagged as counterfeit.
ig: , ọ bụghị koodu nkwenye MedGuard. MedGuard enweghị ike nyochaa ihe a, mana akpọghị ya dị ka adịgboroja.

source: Not Found in MedGuard System
ig: Ahụghị na Sistemụ MedGuard

source: is not registered in the MedGuard system. This drug may be counterfeit. Please report it.
ig: edeghị aha na sistemu MedGuard. Ọgwụ a nwere ike ịbụ adịgboroja. Biko kọọ ya.

source: Details:
ig: Nkọwa:

source: The scanned code links to the following address:
ig: Koodu a nyochara na-ejikọta na adreesị a:

source: Proceed to Website
ig: Gaa na Weebụsaịtị

source: The scanned
ig: Nke a nyochara

source: contained the following unrecognized data:
ig: nwere data ndị a amataghị:

source: What To Do Next
ig: Ihe ị ga-eme ọzọ

source: <strong>Cross-check with NAFDAC:</strong> You can search for the drug on the official NAFDAC Greenbook or use their Mobile Authentication Service (MAS) for certain products.
ig: <strong>Lelee na NAFDAC:</strong> Ị nwere ike ịchọ ọgwụ ahụ na akwụkwọ ndụ akwụkwọ ndụ NAFDAC gọọmentị ma ọ bụ jiri Mobile Authentication Service (MAS) ha maka ngwaahịa ụfọdụ.

source: <strong>Report to MedGuard:</strong> If you are suspicious, use the "Report Counterfeit" form on our main page to alert regulators through our system.
ig: <strong>Kọọrọ MedGuard:</strong> Ọ bụrụ na ị na-enyo enyo, jiri fọm "Kọọ adịgboroja" dị na ibe anyị iji mee ka ndị na-achịkwa mara site na sistemụ anyị.

source: <strong>Report Officially to NAFDAC:</strong> For a direct report to the authorities, you can contact NAFDAC's Pharmacovigilance department via email at
ig: <strong>Kọọrọ NAFDAC n'ihu ọha:</strong> Maka akụkọ kpọmkwem nye ndị ọchịchị, ị nwere ike ịkpọtụrụ ngalaba Pharmacovigilance nke NAFDAC site na email na

source: Experiencing a Side Effect?
ig: Na-enwe mmetụta dị n'akụkụ?

source: Help keep our medicines safe by reporting any unexpected reactions. Your contribution is vital for public health.
ig: Nyere aka mee ka ọgwụ anyị dị nchebe site n'ịkọ mmeghachi omume ọ bụla a na-atụghị anya ya. Enyemaka gị dị oke mkpa maka ahụike ọha.

source: Report a Side Effect
ig: Kọọ mmetụta dị n'akụkụ

source: Checked on
ig: Elele na

source: Scan Another Code
ig: Nyochaa Koodu ọzọ

source: Because your health deserves the truth.
ig: N'ihi na ahụike gị kwesịrị eziokwu.

source: No more guessing — just scanning.
ig: Enweghịzi ịkọ nkọ - naanị nyocha.

source: Keeping counterfeit meds off the streets.
ig: Idebe ọgwụ adịgboroja n'okporo ámá.

source: Your pocket pharmacist.
ig: Onye na-ere ọgwụ n'akpa gị.

source: Batch number is required to report.
ig: A chọrọ nọmba batch iji kọọ.

source: Error submitting report.
ig: Njehie na-edobe akụkọ.

source: Report submitted successfully
ig: Edobere akụkọ nke ọma

source: Camera access failed. Please check permissions.
ig: Ịnweta igwefoto daa. Biko lelee ikike.

source: Please enter a batch number.
ig: Biko tinye nọmba batch.

source: 📷 Scan QR / Barcode
ig: 📷 Nyochaa QR / Barcode

source: Start Camera
ig: Malite Igwefoto

source: Stop
ig: Kwụsị

source: 🔍 Or Verify by Batch Number
ig: 🔍 Ma ọ bụ nyochaa site na nọmba Batch

source: Verify
ig: Nyochaa

source: 🚨 Report Counterfeit
ig: 🚨 Kọọ adịgboroja

source: Drug name
ig: Aha ọgwụ

source: Batch number
ig: Nọmba batch

source: Location (optional)
ig: Ebe (nhọrọ)

source: Note (optional)
ig: Mara (nhọrọ)

source: Report
ig: Akụkọ
