Repository: HSSamuel/MEDGuard
Catalog: frontend/translations/yo/LC_MESSAGES/messages.po
Languages: yo

source: About MedGuard
yo: Nípa MedGuard

source: Your Partner in Pharmaceutical Safety
yo: Alábàápín Rẹ nínú Ààbò Oògùn

source: is a comprehensive, multi-faceted public health platform designed with a singular, critical mission: to build a resilient and transparent pharmaceutical supply chain in Nigeria. We aim to safeguard public health by detecting, reporting, and managing counterfeit drugs while also monitoring the safety of legitimate medications through adverse reaction reporting.
yo: jẹ́ pẹpẹ ìlera gbogbo ènìyàn tí ó ní ojú púpọ̀, tí a ṣe pẹ̀lú ète pàtàkì kan ṣoṣo: láti kọ́ ìpèsè oògùn tí ó lágbára àti tí ó ṣe kedere ní Nàìjíríà. Ète wa ni láti dáàbò bo ìlera gbogbo ènìyàn nípa wíwárí, ìròyìn, àti ṣíṣàkóso àwọn oògùn ayédèrú, àti pẹ̀lú síṣe àbojútó ààbò àwọn oògùn tí ó tọ́ nípasẹ̀ ìròyìn àwọn ìṣẹ̀lẹ̀ búburú.

source: The Silent Epidemic
yo: Àjàkálẹ̀ Àrùn Tí ó Dákẹ́

source: The circulation of counterfeit and substandard drugs is a silent epidemic with devastating consequences. These fake medications can contain incorrect ingredients, the wrong dosage, or even toxic substances, leading to treatment failure, severe health complications, and death. This threat erodes public trust in our healthcare system, putting every citizen at risk.
yo: Pípín káàkiri àwọn oògùn ayédèrú àti àwọn tí kò pé jẹ́ àjàkálẹ̀ àrùn tí ó dákẹ́ pẹ̀lú àwọn àbájáde búburú. Àwọn oògùn wọ̀nyí le ní àwọn èròjà tí kò tọ́, ìwọ̀n tí kò tọ́, tàbí àwọn nǹkan olóró, èyí tí ó le fa àìṣe-oògùn, àwọn ìṣòro ìlera tó lágbára, àti ikú. Ìhàlẹ̀ yíì mú ìgbẹ́kẹ̀lé kúrò nínú ètò ìlera wa, tí ó sì fi gbogbo ọmọ ìlú sínú ewu.

source: A Two-Pronged Defense
yo: Ààbò Onígun Méjì

source: MedGuard tackles this challenge with a dual-layered approach, empowering both the public and regulatory bodies like NAFDAC to become active guardians of our nation's medicine supply.
yo: MedGuard koju ìpèníjà yíì pẹ̀lú ọ̀nà onípele méjì, nípa fífún àwọn ará ìlú àti àwọn àjọ ìṣàkóso bíi NAFDAC lágbára láti di olùṣọ́ tí ó ṣiṣẹ́ fún ìpèsè oògùn orílẹ̀-èdè wa.

source: Counterfeit Drug Verification:
yo: Ìṣedájú Oògùn Ayédèrú:

source: We provide every Nigerian with simple, powerful tools to instantly verify the authenticity of their medication. Through QR code scanning and batch number verification, our platform serves as a frontline defense against dangerous fakes.
yo: A pèsè fún gbogbo ọmọ Nàìjíríà pẹ̀lú àwọn irinṣẹ́ tí ó rọrùn àti tí ó lágbára láti ṣèdájú ìṣe-oògùn wọn lẹ́sẹ̀kẹsẹ̀. Nípasẹ̀ síṣayẹwo koodu QR àti ìṣedájú nọ́mbà ìpele, pẹpẹ wa jẹ́ ìgbàbò iwájú lòdì sí àwọn ayédèrú eewu.

source: Pharmacovigilance & Safety Monitoring:
yo: Pharmacovigilance & Abojuto Aabo:

source: Our mission extends beyond counterfeits. MedGuard provides a direct channel for the public to report adverse drug reactions (ADRs) to legitimate medications. This crowdsourced data is critical for post-market surveillance and ensures that even approved drugs are continuously monitored for safety.
yo: Iṣẹ́ wa kọjá àwọn ayédèrú. MedGuard pèsè ọ̀nà tààrà fún àwọn ará ìlú láti ròyìn àwọn ìṣẹ̀lẹ̀ búburú oògùn (ADRs) sí àwọn oògùn tí ó tọ́. Dátà tí a kójọ láti ọ̀dọ̀ àwọn ènìyàn yíì ṣe pàtàkì fún àbojútó lẹ́yìn ìtajà àti pé ó ríi dájú pé a ń bojú tó ààbò àwọn oògùn tí a fọwọ́sí.

source: Our Core Features
yo: Àwọn Ohun Pàtàkì Wa

source: Instant QR & Batch Verification:
yo: Ìṣedájú Lẹ́sẹ̀kẹsẹ̀ pẹ̀lú QR & Nọ́mbà Ìpele:

source: Instantly validate a drug's authenticity against a secure, regulator-managed database using your smartphone camera or by entering a batch number.
yo: Ṣèdájú ìṣe-oògùn kan lẹ́sẹ̀kẹsẹ̀ lòdì sí ìbùdó dátà tí ó ní ààbò, tí àwọn aláṣẹ ń ṣàkóso, nípa lílo kámẹ́rà foonu rẹ tàbí nípa titẹ nọ́mbà ìpele sii.

source: Anonymous Counterfeit Reporting:
yo: Ìròyìn Ayédèrú Láì Sọ Orukọ:

source: Easily submit reports of suspicious medications, complete with photographic evidence and location data, to alert authorities in real-time.
yo: Fi ìròyìn àwọn oògùn tí ó ń sé sí-e-méjì rọrùn, pẹ̀lú ẹ̀rí fọ́tò àti dátà ibi, láti kìlọ̀ fún àwọn aláṣẹ ní àsìkò gidi.

source: Adverse Drug Reaction (ADR) Reporting:
yo: Ìròyìn Ìṣẹ̀lẹ̀ Búburú Oògùn (ADR):

source: After verifying a legitimate drug, users can report any unexpected side effects, contributing vital data to national pharmacovigilance efforts.
yo: Lẹ́yìn ìṣedájú oògùn tí ó tọ́, àwọn olùlò le ròyìn àwọn ìṣẹ̀lẹ̀ tí a kò retí, nípa bẹ́ẹ̀ wọ́n ń ṣèrànwọ́ pẹ̀lú dátà pàtàkì fún àwọn ìgbìyànjú pharmacovigilance orílẹ̀-èdè.

source: Offline SMS Functionality:
yo: Lílo SMS Láì Ní Íńtánẹ́ẹ̀tì:

source: For citizens without consistent internet access, our system works via SMS, ensuring that everyone can verify their medication, anytime, anywhere.
yo: Fún àwọn ará ìlú tí kò ní ànfàní sí íńtánẹ́ẹ̀tì nígbà gbogbo, ètò wa ń ṣiṣẹ́ nípasẹ̀ SMS, nípa bẹ́ẹ̀ a ríi dájú pé gbogbo ènìyàn le ṣèdájú oògùn wọn, nígbàkúgbà, níbikíbi.

source: Admin Dashboard for Regulators:
yo: Pẹpẹ Ìṣàkóso fún Àwọn Aláṣẹ:

source: A powerful, secure dashboard for authorities to view, filter, and manage all submitted counterfeit and ADR reports, complete with data visualizations and a live hotspot map.
yo: Pẹpẹ ìṣàkóso tí ó lágbára, tí ó sì ní ààbò fún àwọn aláṣẹ láti wò, ṣàlò, àti ṣàkóso gbogbo àwọn ìròyìn ayédèrú àti ADR tí a fi ránṣẹ́, pẹ̀lú àwọn àwòrán dátà àti máàpù ibi tí ìṣẹ̀lẹ̀ ti pọ̀.

source: Return to Home
yo: Padà sí Ojú-ewé Àkọ́kọ́

source: 🛠 Admin — Register New Drug Batch
yo: 🛠 Abójútó — Forúkọsílẹ̀ Ìpele Oògùn Tuntun

source: Loading time...
yo: Àkókò ń ṣàgbéjáde...

source: Session ends in:
yo: Ìgbà ìṣiṣẹ́ yóò parí ní:

source: Use this form to register a new drug batch and generate its QR code instantly.
yo: Lo fọ́ọ̀mù yí láti forúkọsílẹ̀ ìpele oògùn tuntun kí o sì gba kóòdù QR rẹ̀ lẹ́sẹ̀kẹsẹ̀.

source: 💊 Registered Drugs
yo: 💊 Àwọn Oògùn Tí A Ti Forúkọsílẹ̀

source: 📱 Simulate SMS
yo: 📱 Ṣe Àfarawé SMS

source: 📦 Batch Details
yo: 📦 Àlàyé Ìpele

source: Close Scanner
yo: Pa Skenà

source: Mfg Date
yo: Déètì Ìṣelọ́pọ̀

source: Expiry Date
yo: Déètì Ìparí

source: Register &amp; Get QR
yo: Forúkọsílẹ̀ & Gba QR

source: 📷 Scan to Pre-fill
yo: 📷 Ṣàbójútó láti Kọ Tẹ́lẹ̀

source: 📄 Generated QR Code
yo: 📄 Kóòdù QR Tí A Ṣẹ̀dá

source: Right-click and save the image below to print or share.
yo: Tẹ-ọtun kí o sì fi àwòrán ìsàlẹ̀ pamọ́ láti tẹ̀ jáde tàbí pín.

source: 🚨 Counterfeit Reports
yo: 🚨 Àwọn Ìròyìn Ayédèrú

source: Today’s Reports
yo: Àwọn Ìròyìn Òní

source: View All Reports
yo: Wo Gbogbo Ìròyìn

source: 🔍 Search reports...
yo: 🔍 Wá ìròyìn...

source: From:
yo: Láti:

source: To:
yo: Sí:

source: Filter
yo: Ṣàṣàyàn

source: Drug Name
yo: Orúkọ Oògùn

source: Batch
yo: Ìpele

source: Location
yo: Ibùdó

source: Note
yo: Àkíyèsí

source: Image
yo: Àwòrán

source: Analysis
yo: Ìtúpalẹ̀

source: Date
yo: Déètì

source: Reporter
yo: Olùròyìn

source: Status
yo: Ipò

source: Actions
yo: Àwọn Ìgbésẹ̀

source: No Image
yo: Kò sí Àwòrán

source: Analyze
yo: Ṣe Ìtúpalẹ̀

source: N/A
yo: Kò Sí

source: New
yo: Tuntun

source: Checked
yo: Ti Ṣàyẹ̀wò

source: Delete
yo: Paarẹ́

source: No reports submitted yet.
yo: Kò sí ìròyìn kankan tí a ti gbà síbẹ̀.

source: 💊 Adverse Drug Reaction Reports
yo: 💊 Àwọn Ìròyìn Ìṣẹ̀lẹ̀ Oògùn Búburú

source: Search by drug, batch, or reaction...
yo: Wá nípa oògùn, ìpele, tàbí ìṣẹ̀lẹ̀...

source: Filter ADR
yo: Ṣàṣàyàn ADR

source: Export Word
yo: Kó jáde sí Word

source: Export PDF
yo: Kó jáde sí PDF

source: Batch Number
yo: Nọ́mbà Ìpele

source: Patient Info
yo: Ìwífún Aláìsàn

source: Reaction Description
yo: Àpèjúwe Ìṣẹ̀lẹ̀

source: Report Date
yo: Déètì Ìròyìn

source: No Adverse Drug Reaction reports match the current filters.
yo: Kò sí ìròyìn Ìṣẹ̀lẹ̀ Oògùn Búburú tí ó bá àwọn àṣàyàn lọ́wọ́lọ́wọ́ mu.

source: Confirm Deletion
yo: Jẹ́rìí sí Pípaarẹ́

source: Are you sure you want to delete ADR Report #
yo: Ṣé o dájú pé o fẹ́ pa Ìròyìn ADR #

source: ? This is permanent.
yo: rẹ́? Ìgbésẹ̀ yí kò ṣeé yí padà.

source: Failed to delete report:
yo: Ìtìbómi láti pa ìròyìn rẹ́:

source: Error checking for new reports:
yo: Àṣìṣe nígbà tí a ń ṣàyẹ̀wò àwọn ìròyìn tuntun:

source: Please select both a start and end date.
yo: Jọ̀wọ́ yan déètì ìbẹ̀rẹ̀ àti ìparí.

source: Search, filter, or export registered drug batches.
yo: Wá, ṣàṣàyàn, tàbí kó àwọn ìpele oògùn tí a forúkọsílẹ̀ jáde.

source: Search by name or batch number
yo: Wá nípa orúkọ tàbí nọ́mbà ìpele

source: -- All --
yo: -- Gbogbo --

source: Valid
yo: Tọ̀nà

source: Expired
yo: Ó ti parí

source: Expiring Soon
yo: Ó Fẹ́rẹ̀ẹ́ Parí

source: 🔍 Search
yo: 🔍 Wá

source: 📅 Apply
yo: 📅 Fi sílò

source: Name
yo: Orúkọ

source: Batch #
yo: Ìpele #

source: Manufacturer
yo: Olùṣelọ́pọ̀

source: Registered On
yo: Forúkọsílẹ̀ Ní

source: No drugs found.
yo: Kò sí oògùn kankan.

source: ⬅ Prev
yo: ⬅ Tẹ́lẹ̀

source: Page
yo: Ojú-ewé

source: of
yo: nínú

source: Next ➡
yo: T’ó Kàn ➡

source: ⬅ Back to Dashboard
yo: ⬅ Padà sí Pẹpẹ Ìṣàkóso

source: Are you sure you want to delete this drug?
yo: Ṣé o dájú pé o fẹ́ pa oògùn yí rẹ́?

source: Are you sure you want to delete the drug
yo: Ṣé o dájú pé o fẹ́ pa oògùn náà

source: ? This action cannot be undone.
yo: rẹ́? Ìgbésẹ̀ yí kò ṣeé yí padà.

source: 🔐 Regulator Login
yo: 🔐 Ìwọlé Aláṣẹ

source: Official email
yo: Imeeli ìjọba

source: Show Password
yo: Fi Ọ̀rọ̀ Aṣínà Hàn

source: 📍 Live Counterfeit Hotspot Map
yo: 📍 Mápù Gidi ti Ibùdó Ayédèrú

source: This map displays the real-time locations of all submitted counterfeit drug reports. Use this intelligence to identify clusters and potential hotspots for targeted investigation.
yo: Mápù yí fi àwọn ibùdó gidi hàn ti gbogbo ìròyìn oògùn ayédèrú. Lo ìmọ̀ yí láti ṣe ìdámọ̀ àwọn àkójọpọ̀ àti àwọn ibi tí ó ṣeéṣe fún ìwádìí.

source: Your session has expired. Please log in again to view the map.
yo: Ìgbà ìṣiṣẹ́ rẹ ti parí. Jọ̀wọ́ wọlé lẹ́ẹ̀kansíi láti wo mápù.

source: Public Drug Data Manager
yo: Olùṣàkóso Dátà Oògùn Gbogbogbòò

source: View, add, or edit entries in the public drug database. This information is shown to users when a scanned drug is not in the main MedGuard registry.
yo: Wo, fikún, tàbí ṣàtúnṣe àwọn àkọsílẹ̀ nínú ìbùdó dátà oògùn gbogbogbòò. A máa ń fi ìwífún yí han àwọn olùlò nígbà tí oògùn tí a ṣàbójútó kò sí nínú ìforúkọsílẹ̀ MedGuard.

source: Current Public Drug List
yo: Àkójọ Oògùn Gbogbogbòò Lọ́wọ́lọ́wọ́

source: ➕ Add New Drug
yo: ➕ Fi Oògùn Tuntun Kún

source: Add New Drug Entry
yo: Fi Àkọsílẹ̀ Oògùn Tuntun Kún

source: Batch Number (Unique Key):
yo: Nọ́mbà Ìpele (Kọ́kọ́rọ́ Aláìlẹ́gbẹ́):

source: Drug Name:
yo: Orúkọ Oògùn:

source: Manufacturer:
yo: Olùṣelọ́pọ̀:

source: NAFDAC Status:
yo: Ipò NAFDAC:

source: Expiry Date (YYYY-MM-DD):
yo: Déètì Ìparí (ỌỌỌỌ-OṣÙ-ỌJỌ́):

source: Save Entry
yo: Fi Àkọsílẹ̀ Pamọ́

source: Report an Adverse Reaction
yo: Ròyìn Ìṣẹ̀lẹ̀ Àìdára

source: You are reporting a side effect for the following medication. Please provide as much detail as possible. Your report is anonymous and helps protect public health.
yo: O ń ròyìn ìṣẹ̀lẹ̀ àìdára fún oògùn yìí. Jọ̀wọ́ pèsè àlàyé kíkún. Ìròyìn rẹ jẹ́ àìlórúkọ ó sì ń ṣèrànwọ́ láti dáàbò bo ìlera gbogbo ènìyàn.

source: Batch Number:
yo: Nọ́mbà Ìpele:

source: Patient's Age Range
yo: Sáà Orí-ọjọ́ Aláìsàn

source: Please select an age range...
yo: Jọ̀wọ́ yan sáà orí-ọjọ́...

source: 0 - 17 years
yo: Ọdún 0 - 17

source: 18 - 29 years
yo: Ọdún 18 - 29

source: 30 - 49 years
yo: Ọdún 30 - 49

source: 50 - 65 years
yo: Ọdún 50 - 65

source: 66 years and over
yo: Ọdún 66 àti jù bẹ́ẹ̀ lọ

source: Patient's Gender
yo: Akọ-ń-bábo Aláìsàn

source: Please select a gender...
yo: Jọ̀wọ́ yan akọ-ń-bábo...

source: Male
yo: Okùnrin

source: Female
yo: Obìnrin

source: Prefer not to say
yo: Mi ò fẹ́ sọ

source: When did the reaction start?
yo: Nígbà wo ni ìṣẹ̀lẹ̀ náà bẹ̀rẹ̀?

source: Please describe the side effect(s)
yo: Jọ̀wọ́ ṣàpèjúwe ìṣẹ̀lẹ̀ àìdára náà

source: Was the patient taking any other medications at the time?
yo: Ṣé aláìsàn náà ń lo oògùn mìíràn ní àkókò náà?

source: List other drugs, vitamins, or supplements. If none, leave blank.
yo: Kọ orúkọ àwọn oògùn, fítámì, tàbí àfikún mìíràn. Bí kò bá sí, fi sílẹ̀ ní òfo.

source: Submit Secure Report
yo: Fi Ìròyìn Aláàbò Ránṣẹ́

source: Home
yo: Ilé

source: About
yo: Nípa

source: My Reports
yo: Àwọn Ìròyìn Mi

source: Dashboard
yo: Pẹpẹ Ìṣàkóso

source: Public DB Manager
yo: Olùṣàkóso DB Gbogbogbòò

source: Hotspot Map
yo: Mápù Ibùdó

source: Language
yo: Èdè

source: Admin Logout
yo: Ìjáde Abójútó

source: Welcome,
yo: Ẹ kú àbọ̀,

source: Logout
yo: Jáde

source: User Login
yo: Ìwọlé Olùlò

source: Register
yo: Forúkọsílẹ̀

source: Confirm Action
yo: Jẹ́rìí sí Ìgbésẹ̀

source: Cancel
yo: Fagilé

source: Confirm
yo: Jẹ́rìí

source: Session Timeout Warning
yo: Ìkìlọ̀ Ìparí Ìgbà Ìṣiṣẹ́

source: Your session is about to expire due to inactivity. You will be logged out in
yo: Ìgbà ìṣiṣẹ́ rẹ fẹ́rẹ̀ẹ́ parí nítorí àìṣiṣẹ́. A óò yọ ọ́ kúrò ní ìṣẹ́jú

source: seconds.
yo: aáyá.

source: Stay Logged In
yo: Dúró Nínú Ìwọlé

source: Logout Now
yo: Jáde Nísinsìnyí

source: MedGuard — Fighting counterfeit medicine, one scan at a time.
yo: MedGuard — Ìjàkadì lòdì sí oògùn ayédèrú, ìṣàbójútó kan ní àkókò kan.

source: MedGuard Assistant
yo: Olùrànlọ́wọ́ MedGuard

source: Hello! How can I help you today? You can ask me how to verify a drug, how to report a counterfeit, or what to do if you find one.
yo: Pẹ́lẹ́ o! Báwo ni mo ṣe lè ràn ọ́ lọ́wọ́ lónìí? O lè bèèrè bí a ṣe ń ṣàyẹ̀wò oògùn, bí a ṣe ń ròyìn ayédèrú, tàbí ohun tí o lè ṣe tí o bá rí ọ̀kan.

source: Ask a question...
yo: Bèèrè ìbéèrè...

source: Send
yo: Fi Ránṣẹ́

source: I am sorry, I am having trouble connecting right now.
yo: Mabinu, mi o le sopọ mọ intanẹẹti ni akoko yii.

source: Hello! I am the MedGuard Assistant. How can I help?
yo: Pẹ́lẹ́ o! Èmi ni Olùrànlọ́wọ́ MedGuard. Báwo ni mo ṣe lè ràn ọ́ lọ́wọ́?

source: How to report a drug?
yo: Báwo ni a ṣe ń ròyìn oògùn?

source: How to verify a drug?
yo: Báwo ni a ṣe ń ṣàyẹ̀wò oògùn?

source: Check a batch status
yo: Ṣàyẹ̀wò ipò ìpele

source: Page Not Found
yo: A ko ri oju-iwe naa

source: The page you are looking for does not exist.
yo: Oju-iwe ti o n wa ko si.

source: Go to Homepage
yo: Lọ si oju-iwe akọkọ

source: Email Address
yo: Adirẹsi Imeeli

source: Password
yo: Ọrọ Aṣínà

source: Sign in
yo: Wọlé

source: Don't have an account?
yo: Ṣe o kò tíì ní àkáùntì?

source: Register here
yo: Forúkọsílẹ̀ níbí

source: My Submitted Reports
yo: Àwọn Ìròyìn Tí Mo Ti Fi Ránṣẹ́

source: Here is a history of the counterfeit drug reports you have submitted.
yo: Èyí ni ìtàn àwọn ìròyìn oògùn ayédèrú tí o ti fi ránṣẹ́.

source: Regulator Status
yo: Ipò Aláṣẹ

source: Pending Review
yo: Nduro de Ayẹwo

source: Reviewed
yo: Ti Ṣàyẹ̀wò

source: You have not submitted any reports yet.
yo: O kò tíì fi ìròyìn kankan ránṣẹ́.

source: Delete Report
yo: Pa Ìròyìn Rẹ́

source: Are you sure you want to delete this report? This action is permanent.
yo: Ṣé o dájú pé o fẹ́ pa ìròyìn yí rẹ́? Ìgbésẹ̀ yí kò ṣeé yí padà.

source: ➕ Create Your Account
yo: ➕ Ṣẹda Àkáùntì Rẹ

source: Full Name
yo: Orúkọ Kíkún

source: Create Account
yo: Ṣẹda Àkáùntì

source: Already have an account?
yo: Ṣe o ti ní àkáùntì tẹ́lẹ̀?

source: Login here
yo: Wọlé níbí

source: Offline / SMS Verification Simulation
yo: Àfarawé Ìṣàyẹ̀wò Láìsí Íńtánẹ́ẹ̀tì / SMS

source: This simulates sending an SMS with a batch number and receiving a text reply from the MedGuard system.
yo: Èyí ń ṣe àfarawé fífi SMS ránṣẹ́ pẹ̀lú nọ́mbà ìpele àti gbígba ìdáhùn padà láti inú ètò MedGuard.

source: Enter batch number
yo: Tẹ nọmba ipele sii

source: Simulate SMS
yo: Ṣe Àfarawé SMS

source: 📲 Simulated SMS Reply:
yo: 📲 Ìdáhùn SMS Tí A Ṣàfarawé:

source: Batch Verified by MedGuard
yo: Ìpele Ti Jẹ́ Ìdánilójú Nípasẹ̀ MedGuard

source: This is an authentic drug registered in the MedGuard system.
yo: Èyí jẹ́ oògùn tòótọ́ tí a forúkọsílẹ̀ nínú ètò MedGuard.

source: Warning: Drug Expired
yo: Ìkìlọ̀: Oògùn Ti Parí

source: This is a registered drug, but it has passed its expiry date. Do not use.
yo: Èyí jẹ́ oògùn tí a forúkọsílẹ̀, ṣùgbọ́n déètì ìparí rẹ̀ ti kọjá. Máṣe lò ó.

source: Public Information Found
yo: A Rí Ìwífún Gbogbogbòò

source: Disclaimer: This information is from a public database and has <u>not</u> been independently verified by MedGuard.
yo: Àlàyé: Ìwífún yìí wá láti inú ìbùdó dátà gbogbogbòò, MedGuard kò sì ti ṣe ìdánilójú rẹ̀.

source: External Website Link
yo: Ìsopọ̀ sí Oju-ìwé Wẹ́ẹ̀bù Òde

source: This
yo: Èyí

source: points to an external website. MedGuard cannot verify its authenticity. Proceed with caution.
yo: kóòdù yí tọ́ka sí ojú-ìwé wẹ́ẹ̀bù òde. MedGuard kò le ṣe ìdánilójú rẹ̀. Máa báa lọ pẹ̀lú ìṣọ́ra.

source: Unregistered Product Code
yo: Kóòdù Ọja Tí A Kò Forúkọsílẹ̀

source: This appears to be a standard product
yo: Èyí dàbí pé ó jẹ́ ọja lásán

source: , not a MedGuard verification code. MedGuard cannot verify this item, but it has not been flagged as counterfeit.
yo: , kì í ṣe kóòdù ìdánilójú MedGuard. MedGuard kò le ṣe ìdánilójú nǹkan yìí, ṣùgbọ́n a kò tíì fi sí àmì pé ó jẹ́ ayédèrú.

source: Not Found in MedGuard System
yo: A Kò Rí Nínú Ètò MedGuard

source: is not registered in the MedGuard system. This drug may be counterfeit. Please report it.
yo: kò sí nínu ètò MedGuard. Ó lè jẹ́ oògùn ayédèrú. Jọ̀wọ́ ròyìn rẹ̀.

source: Details:
yo: Àlàyé:

source: The scanned code links to the following address:
yo: Kóòdù tí a ṣàbójútó sopọ̀ mọ́ àdírẹ́sì ìsàlẹ̀ yìí:

source: Proceed to Website
yo: Lọ sí Ojú-ìwé Wẹ́ẹ̀bù

source: The scanned
yo: Èyí tí a ṣàbójútó

source: contained the following unrecognized data:
yo: ní àwọn dátà àìmọ̀ wọ̀nyí:

source: What To Do Next
yo: Kíni Kóò Kàn Ṣe

source: <strong>Cross-check with NAFDAC:</strong> You can search for the drug on the official NAFDAC Greenbook or use their Mobile Authentication Service (MAS) for certain products.
yo: <strong>Ṣàyẹ̀wò pẹ̀lú NAFDAC:</strong> O le wá oògùn náà lórí ìwé Greenbook ti NAFDAC tàbí lo Iṣẹ́ Ìdánilójú Alágbèéká (MAS) wọn fún àwọn ọja kan.

source: <strong>Report to MedGuard:</strong> If you are suspicious, use the "Report Counterfeit" form on our main page to alert regulators through our system.
yo: <strong>Ròyìn fún MedGuard:</strong> Bí o bá fura, lo fọ́ọ̀mù "Ròyìn Ayédèrú" lórí ojú-ìwé àkọ́kọ́ wa láti fi tó àwọn aláṣẹ létí.

source: <strong>Report Officially to NAFDAC:</strong> For a direct report to the authorities, you can contact NAFDAC's Pharmacovigilance department via email at
yo: <strong>Ròyìn fún NAFDAC:</strong> Fún ìròyìn tààrà sí àwọn aláṣẹ, o le kàn sí ẹ̀ka Pharmacovigilance ti NAFDAC nípasẹ̀ imeeli ní

source: Experiencing a Side Effect?
yo: Ṣé O Ní Ìṣẹ̀lẹ̀ Àìdára?

source: Help keep our medicines safe by reporting any unexpected reactions. Your contribution is vital for public health.
yo: Ṣèrànwọ́ láti jẹ́ kí àwọn oògùn wa wà ní ààbò nípa ríròyìn àwọn ìṣẹ̀lẹ̀ àìròtẹ́lẹ̀. Ìkópa rẹ ṣe pàtàkì fún ìlera gbogbo ènìyàn.

source: Report a Side Effect
yo: Ròyìn Ìṣẹ̀lẹ̀ Àìdára

source: Checked on
yo: A Ṣàyẹ̀wò Ní

source: Scan Another Code
yo: Ṣàbójútó Kóòdù Mìíràn

source: Because your health deserves the truth.
yo: Nítorí ìlera rẹ yẹ fún òtítọ́.

source: No more guessing — just scanning.
yo: Kò sí àròbádé mọ́ — ìṣayẹ̀wò lásán.

source: Keeping counterfeit meds off the streets.
yo: Jẹ́ kí a pa oògùn ayédèrú kúrò ní ojú pópó.

source: Your pocket pharmacist.
yo: Oníṣègùn àpò rẹ.

source: Batch number is required to report.
yo: Nọ́mbà ìpele ṣe pàtàkì láti fi ròyìn.

source: Error submitting report.
yo: Àṣìṣe wà nígbà tí o ń fi ìròyìn ránṣẹ́.

source: Report submitted successfully
yo: Ìròyìn ti jáwọ́ pẹ̀lú àṣeyọrí

source: Camera access failed. Please check permissions.
yo: Àyè sí kámẹ́rà kùnà. Jọ̀wọ́ ṣàyẹ̀wò àwọn ìyọ̀ǹda.

source: Please enter a batch number.
yo: Jọ̀wọ́ tẹ nọ́mbà ìpele sii.

source: 📷 Scan QR / Barcode
yo: 📷 Ṣayẹwo QR / Koodu Pàápàá

source: Start Camera
yo: Bẹrẹ Kamẹra

source: Stop
yo: Dúró

source: 🔍 Or Verify by Batch Number
yo: Tabi Daju Nipa Nọmba Ipele

source: Verify
yo: Dájú

source: 🚨 Report Counterfeit
yo: 🚨 Ròyìn Èròjà Ayédèrú

source: Drug name
yo: Orukọ oogun

source: Batch number
yo: Nọmba ipele

source: Location (optional)
yo: Ibi (kìí ṣe dandan)

source: Note (optional)
yo: Àkíyèsí (kìí ṣe dandan)

source: Report
yo: Ròyìn
