Repository: HSSamuel/MEDGuard
Catalog: frontend/translations/ha/LC_MESSAGES/messages.po
Languages: ha

source: About MedGuard
ha: Game da MedGuard

source: Your Partner in Pharmaceutical Safety
ha: Abokin Harkar Ku a Tsaron Magunguna

source: is a comprehensive, multi-faceted public health platform designed with a singular, critical mission: to build a resilient and transparent pharmaceutical supply chain in Nigeria. We aim to safeguard public health by detecting, reporting, and managing counterfeit drugs while also monitoring the safety of legitimate medications through adverse reaction reporting.
ha: wani dandali ne na lafiyar jama'a mai fa'ida da yawa wanda aka tsara shi da manufa guda ɗaya mai mahimmanci: don gina ingantaccen tsarin samar da magunguna a Najeriya. Muna da nufin kare lafiyar jama'a ta hanyar ganowa, bayar da rahoto, da kuma kula da magungunan jabu yayin da muke sa ido kan tsaron magunguna na gaske ta hanyar rahoton illar da magani ya haifar.

source: The Silent Epidemic
ha: Anoba A Cikin Shiru

source: The circulation of counterfeit and substandard drugs is a silent epidemic with devastating consequences. These fake medications can contain incorrect ingredients, the wrong dosage, or even toxic substances, leading to treatment failure, severe health complications, and death. This threat erodes public trust in our healthcare system, putting every citizen at risk.
ha: Yaduwar magungunan jabu da marasa inganci annoba ce a cikin shiru mai mummunan sakamako. Waɗannan magungunan na bogi na iya ƙunsar abubuwan da ba daidai ba, sashi mara daidai, ko ma abubuwa masu guba, wanda ke haifar da gazawar magani, matsanancin matsalolin lafiya, da mutuwa. Wannan barazanar tana lalata amincewar jama'a ga tsarin kula da lafiyarmu, wanda ke jefa kowane ɗan ƙasa cikin haɗari.

source: A Two-Pronged Defense
ha: Kariya Mai Hanyoyi Biyu

source: MedGuard tackles this challenge with a dual-layered approach, empowering both the public and regulatory bodies like NAFDAC to become active guardians of our nation's medicine supply.
ha: MedGuard na magance wannan ƙalubale ta hanyar hanyoyi biyu, wanda ke ba da ƙarfi ga jama'a da hukumomin da ke kula da harkokin kamar NAFDAC su zama masu himma wajen kare samar da magunguna na ƙasarmu.

source: Counterfeit Drug Verification:
ha: Tabbatar da Maganin Jabu:

source: We provide every Nigerian with simple, powerful tools to instantly verify the authenticity of their medication. Through QR code scanning and batch number verification, our platform serves as a frontline defense against dangerous fakes.
ha: Muna samar wa kowane ɗan Najeriya da kayan aiki masu sauƙi da ƙarfi don tabbatar da sahihancin maganinsu nan take. Ta hanyar duba lambar QR da tabbatar da lambar rukunin, dandalinmu yana aiki a matsayin kariya ta farko daga magungunan jabu masu haɗari.

source: Pharmacovigilance & Safety Monitoring:
ha: Sa ido kan Magunguna & Kula da Tsaro:

source: Our mission extends beyond counterfeits. MedGuard provides a direct channel for the public to report adverse drug reactions (ADRs) to legitimate medications. This crowdsourced data is critical for post-market surveillance and ensures that even approved drugs are continuously monitored for safety.
ha: Ayyukanmu ya wuce magungunan jabu kawai. MedGuard na samar da hanya kai tsaye ga jama'a don bayar da rahoton illar da magani ya haifar (ADRs) ga magunguna na gaske. Wannan bayanin da aka tattara daga jama'a yana da mahimmanci ga sa ido bayan kasuwa kuma yana tabbatar da cewa ana ci gaba da sa ido kan tsaron ko da magungunan da aka amince da su.

source: Our Core Features
ha: Muhimman Ayyukanmu

source: Instant QR & Batch Verification:
ha: Tabbatar da QR & Lamba Nan Take:

source: Instantly validate a drug's authenticity against a secure, regulator-managed database using your smartphone camera or by entering a batch number.
ha: Tabbatar da sahihancin magani nan take ta hanyar kwatanta shi da wani tumbun bayanai mai tsaro da hukuma ke sarrafawa ta amfani da kyamarar wayarka ko shigar da lambar rukunin.

source: Anonymous Counterfeit Reporting:
ha: Bayar da Rahoton Jabu Ba tare da Sunaba:

source: Easily submit reports of suspicious medications, complete with photographic evidence and location data, to alert authorities in real-time.
ha: A sauƙaƙe, aika da rahotannin magunguna masu tuhuma, tare da hujjar hoto da bayanan wuri, don faɗakar da hukumomi a ainihin lokacin.

source: Adverse Drug Reaction (ADR) Reporting:
ha: Bayar da Rahoton Illar Magani (ADR):

source: After verifying a legitimate drug, users can report any unexpected side effects, contributing vital data to national pharmacovigilance efforts.
ha: Bayan tabbatar da magani na gaske, masu amfani za su iya bayar da rahoton duk wani tasiri da ba a zata ba, wanda ke ba da gudummawar muhimman bayanai ga kokarin sa ido kan magunguna na kasa.

source: Offline SMS Functionality:
ha: Aiki ta SMS ba tare da Intanet ba:

source: For citizens without consistent internet access, our system works via SMS, ensuring that everyone can verify their medication, anytime, anywhere.
ha: Ga 'yan ƙasa da ba su da damar intanet a koda yaushe, tsarinmu yana aiki ta hanyar SMS, wanda ke tabbatar da cewa kowa zai iya tabbatar da maganinsa, a kowane lokaci, a ko'ina.

source: Admin Dashboard for Regulators:
ha: Dashboard na Gudanarwa ga Hukumomi:

source: A powerful, secure dashboard for authorities to view, filter, and manage all submitted counterfeit and ADR reports, complete with data visualizations and a live hotspot map.
ha: Dashboard mai ƙarfi, mai tsaro ga hukumomi don dubawa, tacewa, da kuma sarrafa dukkan rahotannin jabu da ADR da aka aika, tare da zane-zanen bayanai da taswirar wuraren da abin ya fi zafi a ainihin lokacin.

source: Return to Home
ha: Koma Babban Shafin

source: 🛠 Admin — Register New Drug Batch
ha: 🛠 Gudanarwa — Yi Rijistar Sabon Rukunin Magani

source: Loading time...
ha: Ana kawo lokaci...

source: Session ends in:
ha: Zaman zai ƙare a cikin:

source: Use this form to register a new drug batch and generate its QR code instantly.
ha: Yi amfani da wannan fom don yin rijistar sabon rukunin magani da samar da lambarsa ta QR nan take.

source: 💊 Registered Drugs
ha: 💊 Magungunan da aka Yi Rijista

source: 📱 Simulate SMS
ha: 📱 Kwaikwayi SMS

source: 📦 Batch Details
ha: 📦 Bayanan Rukuni

source: Close Scanner
ha: Rufe Mai Dubawa

source: Mfg Date
ha: Ranar Kera

source: Expiry Date
ha: Ranar Karewa

source: Register &amp; Get QR
ha: Yi Rijista & Samu QR

source: 📷 Scan to Pre-fill
ha: 📷 Duba don Cika Bayanai

source: 📄 Generated QR Code
ha: 📄 Lambar QR da aka Samar

source: Right-click and save the image below to print or share.
ha: Danna-dama ka adana hoton da ke ƙasa don bugawa ko rabawa.

source: 🚨 Counterfeit Reports
ha: 🚨 Rahotannin Jabu

source: Today’s Reports
ha: Rahotannin Yau

source: View All Reports
ha: Duba Dukkan Rahotanni

source: 🔍 Search reports...
ha: 🔍 Bincika rahotanni...

source: From:
ha: Daga:

source: To:
ha: Zuwa:

source: Filter
ha: Tace

source: Drug Name
ha: Sunan Magani

source: Batch
ha: Rukuni

source: Location
ha: Wuri

source: Note
ha: Bayani

source: Image
ha: Hoto

source: Analysis
ha: Bincike

source: Date
ha: Rana

source: Reporter
ha: Mai Rahoto

source: Status
ha: Hali

source: Actions
ha: Ayyuka

source: No Image
ha: Babu Hoto

source: Analyze
ha: Bincika

source: N/A
ha: Babu

source: New
ha: Sabo

source: Checked
ha: An Duba

source: Delete
ha: Share

source: No reports submitted yet.
ha: Babu rahoton da aka aika tukuna.

source: 💊 Adverse Drug Reaction Reports
ha: 💊 Rahotannin Illar Magani

source: Search by drug, batch, or reaction...
ha: Bincika ta magani, rukuni, ko illa...

source: Filter ADR
ha: Tace ADR

source: Export Word
ha: Fitar zuwa Word

source: Export PDF
ha: Fitar zuwa PDF

source: Batch Number
ha: Lambar Rukuni

source: Patient Info
ha: Bayanin Mara Lafiya

source: Reaction Description
ha: Bayanin Illar

source: Report Date
ha: Ranar Rahoto

source: No Adverse Drug Reaction reports match the current filters.
ha: Babu rahoton illar magani da ya dace da matattaran yanzu.

source: Confirm Deletion
ha: Tabbatar da Sharewa

source: Are you sure you want to delete ADR Report #
ha: Ka tabbata kana so ka share Rahoton ADR mai lamba #

source: ? This is permanent.
ha: ? Wannan na dindindin ne.

source: Failed to delete report:
ha: An kasa share rahoto:

source: Error checking for new reports:
ha: Kuskure wajen duba sabbin rahotanni:

source: Please select both a start and end date.
ha: Da fatan za a zaɓi ranar farawa da ta ƙarewa.

source: Search, filter, or export registered drug batches.
ha: Bincika, tace, ko fitar da rukunin magungunan da aka yi rijista.

source: Search by name or batch number
ha: Bincika ta suna ko lambar rukuni

source: -- All --
ha: -- Duka --

source: Valid
ha: Mai Inganci

source: Expired
ha: Ya Kare

source: Expiring Soon
ha: Zai Kare Ba da Dadewa Ba

source: 🔍 Search
ha: 🔍 Bincika

source: 📅 Apply
ha: 📅 Aiwatar

source: Name
ha: Suna

source: Batch #
ha: Rukuni #

source: Manufacturer
ha: Maikera

source: Registered On
ha: An Yi Rijista a

source: No drugs found.
ha: Ba a sami magunguna ba.

source: ⬅ Prev
ha: ⬅ Baya

source: Page
ha: Shafi

source: of
ha: na

source: Next ➡
ha: Gaba ➡

source: ⬅ Back to Dashboard
ha: ⬅ Koma Dashboard

source: Are you sure you want to delete this drug?
ha: Ka tabbata kana so ka share wannan maganin?

source: Are you sure you want to delete the drug
ha: Ka tabbata kana so ka share maganin

source: ? This action cannot be undone.
ha: ? Ba za a iya mayar da wannan aikin ba.

source: 🔐 Regulator Login
ha: 🔐 Shiga ga Hukuma

source: Official email
ha: Imel na hukuma

source: Show Password
ha: Nuna Kalmar Sirri

source: 📍 Live Counterfeit Hotspot Map
ha: 📍 Taswirar Wuraren Jabu a Ainihin Lokaci

source: This map displays the real-time locations of all submitted counterfeit drug reports. Use this intelligence to identify clusters and potential hotspots for targeted investigation.
ha: Wannan taswirar tana nuna wuraren da aka aika rahotannin magungunan jabu a ainihin lokacin. Yi amfani da wannan bayanin don gano gungu da wuraren da za a iya samun matsala don bincike na musamman.

source: Your session has expired. Please log in again to view the map.
ha: Zaman ka ya kare. Da fatan za a sake shiga don duba taswirar.

source: Public Drug Data Manager
ha: Manajan Bayanan Magunguna na Jama'a

source: View, add, or edit entries in the public drug database. This information is shown to users when a scanned drug is not in the main MedGuard registry.
ha: Duba, ƙara, ko gyara shigarwar a cikin tumbun bayanan magunguna na jama'a. Ana nuna wannan bayanin ga masu amfani lokacin da maganin da aka duba ba ya cikin babban rijistar MedGuard.

source: Current Public Drug List
ha: Jerin Magunguna na Jama'a na Yanzu

source: ➕ Add New Drug
ha: ➕ Ƙara Sabon Magani

source: Add New Drug Entry
ha: Ƙara Sabuwar Shigarwar Magani

source: Batch Number (Unique Key):
ha: Lambar Rukuni (Mabuɗi na Musamman):

source: Drug Name:
ha: Sunan Magani:

source: Manufacturer:
ha: Maikera:

source: NAFDAC Status:
ha: Hali na NAFDAC:

source: Expiry Date (YYYY-MM-DD):
ha: Ranar Karewa (YYYY-MM-DD):

source: Save Entry
ha: Adana Shigarwa

source: Report an Adverse Reaction
ha: Bayar da Rahoton Illar Magani

source: You are reporting a side effect for the following medication. Please provide as much detail as possible. Your report is anonymous and helps protect public health.
ha: Kuna bayar da rahoton wata illa ga magani mai zuwa. Da fatan za a ba da cikakken bayani gwargwadon iko. Rahotonku ba shi da suna kuma yana taimakawa wajen kare lafiyar jama'a.

source: Batch Number:
ha: Lambar Rukuni:

source: Patient's Age Range
ha: Shekarun Mara Lafiya

source: Please select an age range...
ha: Da fatan za a zaɓi shekaru...

source: 0 - 17 years
ha: Shekaru 0 - 17

source: 18 - 29 years
ha: Shekaru 18 - 29

source: 30 - 49 years
ha: Shekaru 30 - 49

source: 50 - 65 years
ha: Shekaru 50 - 65

source: 66 years and over
ha: Shekaru 66 zuwa sama

source: Patient's Gender
ha: Jinsin Mara Lafiya

source: Please select a gender...
ha: Da fatan za a zaɓi jinsi...

source: Male
ha: Namiji

source: Female
ha: Mace

source: Prefer not to say
ha: Na fi son kada in faɗa

source: When did the reaction start?
ha: Yaushe illar ta fara?

source: Please describe the side effect(s)
ha: Da fatan za a bayyana illar (illolin)

source: Was the patient taking any other medications at the time?
ha: Shin mara lafiyan yana shan wasu magunguna a lokacin?

source: List other drugs, vitamins, or supplements. If none, leave blank.
ha: Jerin wasu magunguna, bitamin, ko ƙarin abinci. Idan babu, a bar wofi.

source: Submit Secure Report
ha: Aika Rahoto Mai Tsaro

source: Home
ha: Babban Shafin

source: About
ha: Game da

source: My Reports
ha: Rahotanni na

source: Public DB Manager
ha: Manajan DB na Jama'a

source: Hotspot Map
ha: Taswirar Wuraren Zafi

source: Language
ha: Harshe

source: Admin Logout
ha: Fita daga Gudanarwa

source: Welcome,
ha: Barka da zuwa,

source: Logout
ha: Fita

source: User Login
ha: Shiga Mai Amfani

source: Register
ha: Yi Rijista

source: Confirm Action
ha: Tabbatar da Aiki

source: Cancel
ha: Soke

source: Confirm
ha: Tabbatar

source: Session Timeout Warning
ha: Gargaɗin Ƙarewar Zama

source: Your session is about to expire due to inactivity. You will be logged out in
ha: Zaman ka na gab da ƙarewa saboda rashin aiki. Za a fitar da kai a cikin

source: seconds.
ha: daƙiƙa.

source: Stay Logged In
ha: Ci gaba da Kasancewa a ciki

source: Logout Now
ha: Fita Yanzu

source: MedGuard — Fighting counterfeit medicine, one scan at a time.
ha: MedGuard — Yaki da magungunan jabu, duba ɗaya a lokaci guda.

source: MedGuard Assistant
ha: Mataimakin MedGuard

source: Hello! How can I help you today? You can ask me how to verify a drug, how to report a counterfeit, or what to do if you find one.
ha: Sannu! Yaya zan iya taimaka maka a yau? Za ka iya tambayata yadda ake tabbatar da magani, yadda ake bayar da rahoton jabu, ko abin da za a yi idan ka sami ɗaya.

source: Ask a question...
ha: Yi tambaya...

source: Send
ha: Aika

source: I am sorry, I am having trouble connecting right now.
ha: Yi haƙuri, ina fuskantar matsalar haɗi a yanzu.

source: Hello! I am the MedGuard Assistant. How can I help?
ha: Sannu! Ni ne Mataimakin MedGuard. Yaya zan iya taimakawa?

source: How to report a drug?
ha: Yadda ake bayar da rahoton magani?

source: How to verify a drug?
ha: Yadda ake tabbatar da magani?

source: Check a batch status
ha: Duba halin rukuni

source: Page Not Found
ha: Ba a Sami Shafin ba

source: The page you are looking for does not exist.
ha: Shafin da kuke nema babu shi.

source: Go to Homepage
ha: Je zuwa Babban Shafin

source: Email Address
ha: Adireshin Imel

source: Password
ha: Kalmar Sirri

source: Sign in
ha: Shiga

source: Don't have an account?
ha: Ba ka da asusu?

source: Register here
ha: Yi rijista a nan

source: My Submitted Reports
ha: Rahotanni na da na Aika

source: Here is a history of the counterfeit drug reports you have submitted.
ha: Ga tarihin rahotannin magungunan jabu da ka aika.

source: Regulator Status
ha: Halin Hukuma

source: Pending Review
ha: Ana Jiran Dubawa

source: Reviewed
ha: An Duba

source: You have not submitted any reports yet.
ha: Ba ka aika da wani rahoto ba tukuna.

source: Delete Report
ha: Share Rahoto

source: Are you sure you want to delete this report? This action is permanent.
ha: Ka tabbata kana so ka share wannan rahoton? Wannan aikin na dindindin ne.

source: ➕ Create Your Account
ha: ➕ Buɗe Asusunka

source: Full Name
ha: Cikakken Suna

source: Create Account
ha: Buɗe Asusu

source: Already have an account?
ha: Ka riga kana da asusu?

source: Login here
ha: Shiga a nan

source: Offline / SMS Verification Simulation
ha: Kwaikwayon Tabbatarwa ta SMS / Ba tare da Intanet ba

source: This simulates sending an SMS with a batch number and receiving a text reply from the MedGuard system.
ha: Wannan yana kwaikwayon aikawa da SMS mai lambar rukuni da karɓar amsa ta rubutu daga tsarin MedGuard.

source: Enter batch number
ha: Shigar da lambar rukuni

source: Simulate SMS
ha: Kwaikwayi SMS

source: 📲 Simulated SMS Reply:
ha: 📲 Amsar SMS da aka Kwaikwaya:

source: Batch Verified by MedGuard
ha: An Tabbatar da Rukuni ta MedGuard

source: This is an authentic drug registered in the MedGuard system.
ha: Wannan magani ne na gaske da aka yi rijista a cikin tsarin MedGuard.

source: Warning: Drug Expired
ha: Gargaɗi: Maganin ya Kare

source: This is a registered drug, but it has passed its expiry date. Do not use.
ha: Wannan magani ne da aka yi rijista, amma ranar karewarsa ta wuce. Kada a yi amfani da shi.

source: Public Information Found
ha: An Sami Bayanin Jama'a

source: Disclaimer: This information is from a public database and has <u>not</u> been independently verified by MedGuard.
ha: Bayanin Musamman: Wannan bayanin daga tumbun bayanan jama'a ne kuma MedGuard bai tabbatar da shi da kansa ba.

source: External Website Link
ha: Mahaɗin Gidan Yanar Gizo na Waje

source: This
ha: Wannan

source: points to an external website. MedGuard cannot verify its authenticity. Proceed with caution.
ha: yana nuni zuwa gidan yanar gizo na waje. MedGuard ba zai iya tabbatar da sahiĥancinsa ba. A ci gaba da taka tsantsan.

source: Unregistered Product Code
ha: Lambar Samfur da Ba a Yi Rijista ba

source: This appears to be a standard product
ha: Wannan ya zama kamar samfur ne na yau da kullun

source: , not a MedGuard verification code. MedGuard cannot verify this item, but it has not been flagged as counterfeit.
ha: , ba lambar tabbatarwa ta MedGuard ba. MedGuard ba zai iya tabbatar da wannan abu ba, amma ba a yi masa alama a matsayin jabu ba.

source: Not Found in MedGuard System
ha: Ba a Same shi a Tsarin MedGuard ba

source: is not registered in the MedGuard system. This drug may be counterfeit. Please report it.
ha: ba a yi rijistarsa a cikin tsarin MedGuard ba. Wannan maganin na iya zama jabu. Da fatan za a bayar da rahoto.

source: Details:
ha: Bayanai:

source: The scanned code links to the following address:
ha: Lambar da aka duba tana da alaƙa da adireshin mai zuwa:

source: Proceed to Website
ha: Ci gaba zuwa Gidan Yanar Gizo

source: The scanned
ha: Wanda aka duba

source: contained the following unrecognized data:
ha: ya ƙunshi bayanan da ba a gane su ba masu zuwa:

source: What To Do Next
ha: Abin da za a yi na gaba

source: <strong>Cross-check with NAFDAC:</strong> You can search for the drug on the official NAFDAC Greenbook or use their Mobile Authentication Service (MAS) for certain products.
ha: <strong>Bincika da NAFDAC:</strong> Za ka iya bincika maganin a kan Greenbook na NAFDAC ko amfani da Sabis ɗin Tabbatarwa ta Wayar Hannu (MAS) don wasu samfuran.

source: <strong>Report to MedGuard:</strong> If you are suspicious, use the "Report Counterfeit" form on our main page to alert regulators through our system.
ha: <strong>Bayar da rahoto ga MedGuard:</strong> Idan kana da shakku, yi amfani da fom din "Rahoton Jabu" a babban shafinmu don faɗakar da hukumomi ta hanyar tsarinmu.

source: <strong>Report Officially to NAFDAC:</strong> For a direct report to the authorities, you can contact NAFDAC's Pharmacovigilance department via email at
ha: <strong>Bayar da rahoto ga NAFDAC a hukumance:</strong> Don rahoto kai tsaye ga hukumomi, za ka iya tuntuɓar sashen sa ido kan magunguna na NAFDAC ta imel a

source: Experiencing a Side Effect?
ha: Kuna Fuskantar Illar Magani?

source: Help keep our medicines safe by reporting any unexpected reactions. Your contribution is vital for public health.
ha: Taimaka wajen kiyaye magungunanmu ta hanyar bayar da rahoton duk wata illar da ba a zata ba. Gudummawarku tana da mahimmanci ga lafiyar jama'a.

source: Report a Side Effect
ha: Bayar da Rahoton Illa

source: Checked on
ha: An Duba a

source: Scan Another Code
ha: Duba Wata Lamba

source: Because your health deserves the truth.
ha: Domin lafiyarka ta cancanci gaskiya.

source: No more guessing — just scanning.
ha: Babu sauran zato — kawai dubawa.

source: Keeping counterfeit meds off the streets.
ha: Kawar da magungunan jabu daga kan tituna.

source: Your pocket pharmacist.
ha: Maganin aljihunka.

source: Batch number is required to report.
ha: Ana buƙatar lambar rukuni don bayar da rahoto.

source: Error submitting report.
ha: Kuskure wajen aika rahoto.

source: Report submitted successfully
ha: An aika rahoto cikin nasara

source: Camera access failed. Please check permissions.
ha: Samun damar kamara ya gaza. Da fatan za a duba izini.

source: Please enter a batch number.
ha: Da fatan za a shigar da lambar rukuni.

source: 📷 Scan QR / Barcode
ha: 📷 Duba QR / Barcode

source: Start Camera
ha: Fara Kamara

source: Stop
ha: Tsaya

source: 🔍 Or Verify by Batch Number
ha: 🔍 Ko Tabbatar da Lamba ta Rukuni

source: Verify
ha: Tabbatar

source: 🚨 Report Counterfeit
ha: 🚨 Bayar da Rahoton Jabu

source: Drug name
ha: Sunan magani

source: Batch number
ha: Lambar rukuni

source: Location (optional)
ha: Wuri (na zaɓi)

source: Note (optional)
ha: Bayani (na zaɓi)

source: Report
ha: Rahoto
