Repository: HSSamuel/MEDGuard
Catalog: frontend/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: About MedGuard
fr: À propos de MedGuard

source: Your Partner in Pharmaceutical Safety
fr: Votre Partenaire en Sécurité Pharmaceutique

source: is a comprehensive, multi-faceted public health platform designed with a singular, critical mission: to build a resilient and transparent pharmaceutical supply chain in Nigeria. We aim to safeguard public health by detecting, reporting, and managing counterfeit drugs while also monitoring the safety of legitimate medications through adverse reaction reporting.
fr: est une plateforme de santé publique complète et polyvalente conçue avec une mission unique et essentielle : construire une chaîne d'approvisionnement pharmaceutique résiliente et transparente au Nigeria. Notre objectif est de protéger la santé publique en détectant, signalant et gérant les médicaments contrefaits, tout en surveillant la sécurité des médicaments légitimes grâce au signalement des réactions indésirables.

source: The Silent Epidemic
fr: L'Épidémie Silencieuse

source: The circulation of counterfeit and substandard drugs is a silent epidemic with devastating consequences. These fake medications can contain incorrect ingredients, the wrong dosage, or even toxic substances, leading to treatment failure, severe health complications, and death. This threat erodes public trust in our healthcare system, putting every citizen at risk.
fr: La circulation de médicaments contrefaits et de qualité inférieure est une épidémie silencieuse aux conséquences dévastatrices. Ces faux médicaments peuvent contenir des ingrédients incorrects, un mauvais dosage, ou même des substances toxiques, entraînant l'échec du traitement, de graves complications de santé et la mort. Cette menace érode la confiance du public dans notre système de santé, mettant chaque citoyen en danger.

source: A Two-Pronged Defense
fr: Une Défense à Deux Volets

source: MedGuard tackles this challenge with a dual-layered approach, empowering both the public and regulatory bodies like NAFDAC to become active guardians of our nation's medicine supply.
fr: MedGuard aborde ce défi avec une approche à double niveau, en donnant au public et aux organismes de réglementation comme la NAFDAC les moyens de devenir des gardiens actifs de l'approvisionnement en médicaments de notre nation.

source: Counterfeit Drug Verification:
fr: Vérification des Médicaments Contrefaits :

source: We provide every Nigerian with simple, powerful tools to instantly verify the authenticity of their medication. Through QR code scanning and batch number verification, our platform serves as a frontline defense against dangerous fakes.
fr: Nous fournissons à chaque Nigérian des outils simples et puissants pour vérifier instantanément l'authenticité de leurs médicaments. Grâce à la lecture de codes QR et à la vérification du numéro de lot, notre plateforme sert de première ligne de défense contre les contrefaçons dangereuses.

source: Pharmacovigilance & Safety Monitoring:
fr: Pharmacovigilance et Surveillance de la Sécurité :

source: Our mission extends beyond counterfeits. MedGuard provides a direct channel for the public to report adverse drug reactions (ADRs) to legitimate medications. This crowdsourced data is critical for post-market surveillance and ensures that even approved drugs are continuously monitored for safety.
fr: Notre mission va au-delà des contrefaçons. MedGuard offre un canal direct au public pour signaler les réactions indésirables aux médicaments (ADR) légitimes. Ces données participatives sont essentielles pour la surveillance post-commercialisation et garantissent que même les médicaments approuvés sont continuellement surveillés pour leur sécurité.

source: Our Core Features
fr: Nos Fonctionnalités Clés

source: Instant QR & Batch Verification:
fr: Vérification Instantanée par QR et Lot :

source: Instantly validate a drug's authenticity against a secure, regulator-managed database using your smartphone camera or by entering a batch number.
fr: Validez instantanément l'authenticité d'un médicament par rapport à une base de données sécurisée et gérée par les régulateurs en utilisant l'appareil photo de votre smartphone ou en saisissant un numéro de lot.

source: Anonymous Counterfeit Reporting:
fr: Signalement Anonyme de Contrefaçons :

source: Easily submit reports of suspicious medications, complete with photographic evidence and location data, to alert authorities in real-time.
fr: Soumettez facilement des rapports de médicaments suspects, avec des preuves photographiques et des données de localisation, pour alerter les autorités en temps réel.

source: Adverse Drug Reaction (ADR) Reporting:
fr: Signalement des Réactions Indésirables aux Médicaments (ADR) :

source: After verifying a legitimate drug, users can report any unexpected side effects, contributing vital data to national pharmacovigilance efforts.
fr: Après avoir vérifié un médicament légitime, les utilisateurs peuvent signaler tout effet secondaire inattendu, contribuant ainsi à des données vitales pour les efforts nationaux de pharmacovigilance.

source: Offline SMS Functionality:
fr: Fonctionnalité SMS Hors Ligne :

source: For citizens without consistent internet access, our system works via SMS, ensuring that everyone can verify their medication, anytime, anywhere.
fr: Pour les citoyens sans accès Internet constant, notre système fonctionne par SMS, garantissant que tout le monde peut vérifier ses médicaments, à tout moment et n'importe où.

source: Admin Dashboard for Regulators:
fr: Tableau de Bord Administratif pour les Régulateurs :

source: A powerful, secure dashboard for authorities to view, filter, and manage all submitted counterfeit and ADR reports, complete with data visualizations and a live hotspot map.
fr: Un tableau de bord puissant et sécurisé permettant aux autorités de visualiser, filtrer et gérer tous les rapports de contrefaçon et d'ADR soumis, avec des visualisations de données et une carte des points chauds en direct.

source: Return to Home
fr: Retour à l'Accueil

source: 🛠 Admin — Register New Drug Batch
fr: 🛠 Admin — Enregistrer un Nouveau Lot de Médicaments

source: Loading time...
fr: Chargement de l'heure...

source: Session ends in:
fr: La session se termine dans :

source: Use this form to register a new drug batch and generate its QR code instantly.
fr: Utilisez ce formulaire pour enregistrer un nouveau lot de médicaments et générer son code QR instantanément.

source: 💊 Registered Drugs
fr: 💊 Médicaments Enregistrés

source: 📱 Simulate SMS
fr: 📱 Simuler un SMS

source: 📦 Batch Details
fr: 📦 Détails du Lot

source: Close Scanner
fr: Fermer le Scanner

source: Mfg Date
fr: Date de Fabrication

source: Expiry Date
fr: Date d'Expiration

source: Register &amp; Get QR
fr: Enregistrer & Obtenir le QR

source: 📷 Scan to Pre-fill
fr: 📷 Scanner pour Pré-remplir

source: 📄 Generated QR Code
fr: 📄 Code QR Généré

source: Right-click and save the image below to print or share.
fr: Faites un clic droit et enregistrez l'image ci-dessous pour l'imprimer ou la partager.

source: 🚨 Counterfeit Reports
fr: 🚨 Rapports de Contrefaçon

source: Today’s Reports
fr: Rapports d'Aujourd'hui

source: View All Reports
fr: Voir Tous les Rapports

source: 🔍 Search reports...
fr: 🔍 Rechercher des rapports...

source: From:
fr: De :

source: To:
fr: À :

source: Filter
fr: Filtrer

source: Drug Name
fr: Nom du Médicament

source: Batch
fr: Lot

source: Location
fr: Lieu

source: Analysis
fr: Analyse

source: Reporter
fr: Rapporteur

source: Status
fr: Statut

source: No Image
fr: Pas d'Image

source: Analyze
fr: Analyser

source: New
fr: Nouveau

source: Checked
fr: Vérifié

source: Delete
fr: Supprimer

source: No reports submitted yet.
fr: Aucun rapport soumis pour le moment.

source: 💊 Adverse Drug Reaction Reports
fr: 💊 Rapports de Réactions Indésirables aux Médicaments

source: Search by drug, batch, or reaction...
fr: Rechercher par médicament, lot ou réaction...

source: Filter ADR
fr: Filtrer les EIM

source: Export Word
fr: Exporter en Word

source: Export PDF
fr: Exporter en PDF

source: Batch Number
fr: Numéro de Lot

source: Patient Info
fr: Infos Patient

source: Reaction Description
fr: Description de la Réaction

source: Report Date
fr: Date du Rapport

source: No Adverse Drug Reaction reports match the current filters.
fr: Aucun rapport de réaction indésirable ne correspond aux filtres actuels.

source: Confirm Deletion
fr: Confirmer la Suppression

source: Are you sure you want to delete ADR Report #
fr: Êtes-vous sûr de vouloir supprimer le rapport d'EIM #

source: ? This is permanent.
fr: ? Cette action est permanente.

source: Failed to delete report:
fr: Échec de la suppression du rapport :

source: Error checking for new reports:
fr: Erreur lors de la vérification de nouveaux rapports :

source: Please select both a start and end date.
fr: Veuillez sélectionner une date de début et de fin.

source: Search, filter, or export registered drug batches.
fr: Recherchez, filtrez ou exportez des lots de médicaments enregistrés.

source: Search by name or batch number
fr: Rechercher par nom ou numéro de lot

source: -- All --
fr: -- Tous --

source: Valid
fr: Valide

source: Expired
fr: Expiré

source: Expiring Soon
fr: Expire Bientôt

source: 🔍 Search
fr: 🔍 Rechercher

source: 📅 Apply
fr: 📅 Appliquer

source: Name
fr: Nom

source: Batch #
fr: Lot #

source: Manufacturer
fr: Fabricant

source: Registered On
fr: Enregistré le

source: No drugs found.
fr: Aucun médicament trouvé.

source: ⬅ Prev
fr: ⬅ Préc

source: of
fr: de

source: Next ➡
fr: Suiv ➡

source: ⬅ Back to Dashboard
fr: ⬅ Retour au Tableau de Bord

source: Are you sure you want to delete this drug?
fr: Êtes-vous sûr de vouloir supprimer ce médicament ?

source: Are you sure you want to delete the drug
fr: Êtes-vous sûr de vouloir supprimer le médicament

source: ? This action cannot be undone.
fr: ? Cette action ne peut pas être annulée.

source: 🔐 Regulator Login
fr: 🔐 Connexion Régulateur

source: Official email
fr: Email officiel

source: Show Password
fr: Afficher le mot de passe

source: 📍 Live Counterfeit Hotspot Map
fr: 📍 Carte en direct des points chauds de contrefaçon

source: This map displays the real-time locations of all submitted counterfeit drug reports. Use this intelligence to identify clusters and potential hotspots for targeted investigation.
fr: Cette carte affiche les emplacements en temps réel de tous les rapports de médicaments contrefaits soumis. Utilisez cette information pour identifier les clusters et les points chauds potentiels pour une enquête ciblée.

source: Your session has expired. Please log in again to view the map.
fr: Votre session a expiré. Veuillez vous reconnecter pour voir la carte.

source: Public Drug Data Manager
fr: Gestionnaire de Données Publiques sur les Médicaments

source: View, add, or edit entries in the public drug database. This information is shown to users when a scanned drug is not in the main MedGuard registry.
fr: Visualisez, ajoutez ou modifiez les entrées dans la base de données publique des médicaments. Ces informations sont présentées aux utilisateurs lorsqu'un médicament scanné ne figure pas dans le registre principal de MedGuard.

source: Current Public Drug List
fr: Liste Actuelle des Médicaments Publics

source: ➕ Add New Drug
fr: ➕ Ajouter un Nouveau Médicament

source: Add New Drug Entry
fr: Ajouter une Nouvelle Entrée de Médicament

source: Batch Number (Unique Key):
fr: Numéro de Lot (Clé Unique) :

source: Drug Name:
fr: Nom du Médicament :

source: Manufacturer:
fr: Fabricant :

source: NAFDAC Status:
fr: Statut NAFDAC :

source: Expiry Date (YYYY-MM-DD):
fr: Date d'Expiration (AAAA-MM-JJ) :

source: Save Entry
fr: Enregistrer l'Entrée

source: Report an Adverse Reaction
fr: Signaler une Réaction Indésirable

source: You are reporting a side effect for the following medication. Please provide as much detail as possible. Your report is anonymous and helps protect public health.
fr: Vous signalez un effet secondaire pour le médicament suivant. Veuillez fournir autant de détails que possible. Votre rapport est anonyme et aide à protéger la santé publique.

source: Batch Number:
fr: Numéro de Lot :

source: Patient's Age Range
fr: Tranche d'Âge du Patient

source: Please select an age range...
fr: Veuillez sélectionner une tranche d'âge...

source: 0 - 17 years
fr: 0 - 17 ans

source: 18 - 29 years
fr: 18 - 29 ans

source: 30 - 49 years
fr: 30 - 49 ans

source: 50 - 65 years
fr: 50 - 65 ans

source: 66 years and over
fr: 66 ans et plus

source: Patient's Gender
fr: Sexe du Patient

source: Please select a gender...
fr: Veuillez sélectionner un sexe...

source: Male
fr: Homme

source: Female
fr: Femme

source: Prefer not to say
fr: Je préfère ne pas le dire

source: When did the reaction start?
fr: Quand la réaction a-t-elle commencé ?

source: Please describe the side effect(s)
fr: Veuillez décrire le(s) effet(s) secondaire(s)

source: Was the patient taking any other medications at the time?
fr: Le patient prenait-il d'autres médicaments à ce moment-là ?

source: List other drugs, vitamins, or supplements. If none, leave blank.
fr: Énumérez les autres médicaments, vitamines ou suppléments. Si aucun, laissez vide.

source: Submit Secure Report
fr: Soumettre le Rapport Sécurisé

source: Home
fr: Accueil

source: About
fr: À propos

source: My Reports
fr: Mes Rapports

source: Dashboard
fr: Tableau de Bord

source: Public DB Manager
fr: Gestionnaire BD Publique

source: Hotspot Map
fr: Carte des Points Chauds

source: Language
fr: Langue

source: Admin Logout
fr: Déconnexion Admin

source: Welcome,
fr: Bienvenue,

source: Logout
fr: Déconnexion

source: User Login
fr: Connexion Utilisateur

source: Register
fr: S'inscrire

source: Confirm Action
fr: Confirmer l'Action

source: Cancel
fr: Annuler

source: Confirm
fr: Confirmer

source: Session Timeout Warning
fr: Avertissement d'Expiration de Session

source: Your session is about to expire due to inactivity. You will be logged out in
fr: Votre session est sur le point d'expirer en raison de l'inactivité. Vous serez déconnecté dans

source: seconds.
fr: secondes.

source: Stay Logged In
fr: Rester Connecté

source: Logout Now
fr: Se Déconnecter Maintenant

source: MedGuard — Fighting counterfeit medicine, one scan at a time.
fr: MedGuard — Lutter contre les médicaments contrefaits, un scan à la fois.

source: MedGuard Assistant
fr: Assistant MedGuard

source: Hello! How can I help you today? You can ask me how to verify a drug, how to report a counterfeit, or what to do if you find one.
fr: Bonjour ! Comment puis-je vous aider aujourd'hui ? Vous pouvez me demander comment vérifier un médicament, comment signaler une contrefaçon, ou quoi faire si vous en trouvez une.

source: Ask a question...
fr: Posez une question...

source: Send
fr: Envoyer

source: I am sorry, I am having trouble connecting right now.
fr: Je suis désolé, j'ai des difficultés à me connecter en ce moment.

source: Hello! I am the MedGuard Assistant. How can I help?
fr: Bonjour ! Je suis l'Assistant MedGuard. Comment puis-je vous aider ?

source: How to report a drug?
fr: Comment signaler un médicament ?

source: How to verify a drug?
fr: Comment vérifier un médicament ?

source: Check a batch status
fr: Vérifier le statut d'un lot

source: Page Not Found
fr: Page non trouvée

source: The page you are looking for does not exist.
fr: La page que vous recherchez n'existe pas.

source: Go to Homepage
fr: Aller à la page d'accueil

source: Email Address
fr: Adresse E-mail

source: Password
fr: Mot de passe

source: Sign in
fr: Se connecter

source: Don't have an account?
fr: Vous n'avez pas de compte ?

source: Register here
fr: Inscrivez-vous ici

source: My Submitted Reports
fr: Mes Rapports Soumis

source: Here is a history of the counterfeit drug reports you have submitted.
fr: Voici un historique des rapports de médicaments contrefaits que vous avez soumis.

source: Regulator Status
fr: Statut du Régulateur

source: Pending Review
fr: En Attente d'Examen

source: Reviewed
fr: Examiné

source: You have not submitted any reports yet.
fr: Vous n'avez encore soumis aucun rapport.

source: Delete Report
fr: Supprimer le Rapport

source: Are you sure you want to delete this report? This action is permanent.
fr: Êtes-vous sûr de vouloir supprimer ce rapport ? Cette action est permanente.

source: ➕ Create Your Account
fr: ➕ Créez Votre Compte

source: Full Name
fr: Nom Complet

source: Create Account
fr: Créer un Compte

source: Already have an account?
fr: Vous avez déjà un compte ?

source: Login here
fr: Connectez-vous ici

source: Offline / SMS Verification Simulation
fr: Simulation de Vérification Hors Ligne / SMS

source: This simulates sending an SMS with a batch number and receiving a text reply from the MedGuard system.
fr: Ceci simule l'envoi d'un SMS avec un numéro de lot et la réception d'une réponse textuelle du système MedGuard.

source: Enter batch number
fr: Entrez le numéro de lot

source: Simulate SMS
fr: Simuler un SMS

source: 📲 Simulated SMS Reply:
fr: 📲 Réponse SMS Simulée :

source: Batch Verified by MedGuard
fr: Lot Vérifié par MedGuard

source: This is an authentic drug registered in the MedGuard system.
fr: Il s'agit d'un médicament authentique enregistré dans le système MedGuard.

source: Warning: Drug Expired
fr: Avertissement : Médicament Expiré

source: This is a registered drug, but it has passed its expiry date. Do not use.
fr: Il s'agit d'un médicament enregistré, mais sa date de péremption est dépassée. Ne pas utiliser.

source: Public Information Found
fr: Informations Publiques Trouvées

source: Disclaimer: This information is from a public database and has <u>not</u> been independently verified by MedGuard.
fr: Avis de non-responsabilité : Ces informations proviennent d'une base de données publique et n'ont <u>pas</u> été vérifiées indépendamment par MedGuard.

source: External Website Link
fr: Lien vers un Site Web Externe

source: This
fr: Ce

source: points to an external website. MedGuard cannot verify its authenticity. Proceed with caution.
fr: code pointe vers un site web externe. MedGuard ne peut pas vérifier son authenticité. Procédez avec prudence.

source: Unregistered Product Code
fr: Code Produit non Enregistré

source: This appears to be a standard product
fr: Cela semble être un produit standard

source: , not a MedGuard verification code. MedGuard cannot verify this item, but it has not been flagged as counterfeit.
fr: , pas un code de vérification MedGuard. MedGuard ne peut pas vérifier cet article, mais il n'a pas été signalé comme contrefait.

source: Not Found in MedGuard System
fr: Non Trouvé dans le Système MedGuard

source: is not registered in the MedGuard system. This drug may be counterfeit. Please report it.
fr: n'est pas enregistré dans le système MedGuard. Ce médicament peut être contrefait. Veuillez le signaler.

source: Details:
fr: Détails :

source: The scanned code links to the following address:
fr: Le code scanné renvoie à l'adresse suivante :

source: Proceed to Website
fr: Aller sur le Site Web

source: The scanned
fr: Le

source: contained the following unrecognized data:
fr: scanné contenait les données non reconnues suivantes :

source: What To Do Next
fr: Que Faire Ensuite

source: <strong>Cross-check with NAFDAC:</strong> You can search for the drug on the official NAFDAC Greenbook or use their Mobile Authentication Service (MAS) for certain products.
fr: <strong>Vérification croisée avec la NAFDAC :</strong> Vous pouvez rechercher le médicament sur le Greenbook officiel de la NAFDAC ou utiliser leur Service d'Authentification Mobile (MAS) pour certains produits.

source: <strong>Report to MedGuard:</strong> If you are suspicious, use the "Report Counterfeit" form on our main page to alert regulators through our system.
fr: <strong>Signaler à MedGuard :</strong> Si vous avez des doutes, utilisez le formulaire "Signaler une Contrefaçon" sur notre page principale pour alerter les régulateurs via notre système.

source: <strong>Report Officially to NAFDAC:</strong> For a direct report to the authorities, you can contact NAFDAC's Pharmacovigilance department via email at
fr: <strong>Signaler Officiellement à la NAFDAC :</strong> Pour un rapport direct aux autorités, vous pouvez contacter le département de Pharmacovigilance de la NAFDAC par e-mail à

source: Experiencing a Side Effect?
fr: Vous ressentez un effet secondaire ?

source: Help keep our medicines safe by reporting any unexpected reactions. Your contribution is vital for public health.
fr: Aidez à maintenir la sécurité de nos médicaments en signalant toute réaction inattendue. Votre contribution est vitale pour la santé publique.

source: Report a Side Effect
fr: Signaler un Effet Secondaire

source: Checked on
fr: Vérifié le

source: Scan Another Code
fr: Scanner un Autre Code

source: Because your health deserves the truth.
fr: Parce que votre santé mérite la vérité.

source: No more guessing — just scanning.
fr: Plus de devinettes — juste un scan.

source: Keeping counterfeit meds off the streets.
fr: Gardons les médicaments contrefaits hors des rues.

source: Your pocket pharmacist.
fr: Votre pharmacien de poche.

source: Batch number is required to report.
fr: Le numéro de lot est requis pour signaler.

source: Error submitting report.
fr: Erreur lors de la soumission du rapport.

source: Report submitted successfully
fr: Rapport soumis avec succès

source: Camera access failed. Please check permissions.
fr: L'accès à la caméra a échoué. Veuillez vérifier les autorisations.

source: Please enter a batch number.
fr: Veuillez entrer un numéro de lot.

source: 📷 Scan QR / Barcode
fr: 📷 Scanner le Code QR / Code-barres

source: Start Camera
fr: Démarrer la Caméra

source: Stop
fr: Arrêter

source: 🔍 Or Verify by Batch Number
fr: Ou Vérifier par Numéro de Lot

source: Verify
fr: Vérifier

source: 🚨 Report Counterfeit
fr: 🚨 Signaler une Contrefaçon

source: Drug name
fr: Nom du médicament

source: Batch number
fr: Numéro de lot

source: Location (optional)
fr: Lieu (optionnel)

source: Note (optional)
fr: Note (optionnelle)

source: Report
fr: Signaler
